zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
/*
 * Copyright 2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_IOMUXC_H_
#define _FSL_IOMUXC_H_

#include "fsl_common.h"

/*!
 * @addtogroup iomuxc_driver
 * @{
 */

/*! @file */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.iomuxc"
#endif

/*! @name Driver version */
/*@{*/
/*! @brief IOMUXC driver version 2.0.0. */
#define FSL_IOMUXC_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

/*!
 * @name Pin function ID
 * The pin function ID is a tuple of \<muxRegister muxMode inputRegister inputDaisy configRegister\>
 *
 * @{
 */
#define IOMUXC_PIO2_0_HSP_GPIO0_GPIO0                                                         0x421C0000U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_0_HSP_LPUART0_CTS_B                                                       0x421C0000U, 0x1U, 0x421C8260U, 0x0U
#define IOMUXC_PIO2_0_HSP_FLEXIO0_FXIO_D00                                                    0x421C0000U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_0_AUDIO_SAI0_TX_DATA0                                                     0x421C0000U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_0_HSP_eFlexPWM0_PWM_A0                                                    0x421C0000U, 0x4U, 0x421C8138U, 0x0U
#define IOMUXC_PIO2_0_MAIN_AHB_SRAMC_SRAMC_DA00                                               0x421C0000U, 0x5U, 0x421C83C8U, 0x0U
#define IOMUXC_PIO2_0_HSP_QTPM0_CH0                                                           0x421C0000U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_0_MEDIA_DCIF_DATA00                                                       0x421C0000U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_0_HSP_LPI2C0_SDA                                                          0x421C0000U, 0x8U, 0x421C81D0U, 0x0U
#define IOMUXC_PIO2_0_HSP_XBAR0_INOUT00                                                       0x421C0000U, 0xAU, 0x421C82E8U, 0x0U
#define IOMUXC_PIO2_0_HSP_XBAR1_INOUT00                                                       0x421C0000U, 0xBU, 0x421C8358U, 0x0U

#define IOMUXC_PIO2_1_HSP_GPIO0_GPIO1                                                         0x421C0004U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_1_HSP_LPUART0_RTS_B                                                       0x421C0004U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_1_HSP_FLEXIO0_FXIO_D01                                                    0x421C0004U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_1_AUDIO_SAI0_RX_DATA0                                                     0x421C0004U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_1_HSP_eFlexPWM0_PWM_B0                                                    0x421C0004U, 0x4U, 0x421C8144U, 0x0U
#define IOMUXC_PIO2_1_MAIN_AHB_SRAMC_SRAMC_DA01                                               0x421C0004U, 0x5U, 0x421C83CCU, 0x0U
#define IOMUXC_PIO2_1_HSP_QTPM0_CH1                                                           0x421C0004U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_1_MEDIA_DCIF_DATA01                                                       0x421C0004U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_1_HSP_LPI2C0_SCL                                                          0x421C0004U, 0x8U, 0x421C81CCU, 0x0U
#define IOMUXC_PIO2_1_HSP_XBAR0_INOUT01                                                       0x421C0004U, 0xAU, 0x421C82ECU, 0x0U
#define IOMUXC_PIO2_1_HSP_XBAR1_INOUT01                                                       0x421C0004U, 0xBU, 0x421C835CU, 0x0U

#define IOMUXC_PIO2_2_HSP_GPIO0_GPIO2                                                         0x421C0008U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_2_HSP_LPUART0_TXD                                                         0x421C0008U, 0x1U, 0x421C8268U, 0x0U
#define IOMUXC_PIO2_2_HSP_FLEXIO0_FXIO_D02                                                    0x421C0008U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_2_AUDIO_SAI0_TX_BCLK                                                      0x421C0008U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_2_HSP_eFlexPWM0_PWM_A1                                                    0x421C0008U, 0x4U, 0x421C813CU, 0x0U
#define IOMUXC_PIO2_2_MAIN_AHB_SRAMC_SRAMC_DA02                                               0x421C0008U, 0x5U, 0x421C83D0U, 0x0U
#define IOMUXC_PIO2_2_HSP_QTPM0_CH2                                                           0x421C0008U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_2_MEDIA_DCIF_DATA02                                                       0x421C0008U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_2_HSP_LPI2C1_SDA                                                          0x421C0008U, 0x8U, 0x421C81D8U, 0x0U
#define IOMUXC_PIO2_2_HSP_XBAR0_INOUT02                                                       0x421C0008U, 0xAU, 0x421C82F0U, 0x0U
#define IOMUXC_PIO2_2_HSP_XBAR1_INOUT02                                                       0x421C0008U, 0xBU, 0x421C8360U, 0x0U
#define IOMUXC_PIO2_2_COMM_uSDHC0_TST_TRG                                                     0x421C0008U, 0xFU, 0x00000000U, 0x0U

#define IOMUXC_PIO2_3_HSP_GPIO0_GPIO3                                                         0x421C000CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_3_HSP_LPUART0_RXD                                                         0x421C000CU, 0x1U, 0x421C8264U, 0x0U
#define IOMUXC_PIO2_3_HSP_FLEXIO0_FXIO_D03                                                    0x421C000CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_3_AUDIO_SAI0_TX_SYNC                                                      0x421C000CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_3_HSP_eFlexPWM0_PWM_B1                                                    0x421C000CU, 0x4U, 0x421C8148U, 0x0U
#define IOMUXC_PIO2_3_MAIN_AHB_SRAMC_SRAMC_DA03                                               0x421C000CU, 0x5U, 0x421C83D4U, 0x0U
#define IOMUXC_PIO2_3_HSP_QTPM0_CH3                                                           0x421C000CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_3_MEDIA_DCIF_DATA03                                                       0x421C000CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_3_HSP_LPI2C1_SCL                                                          0x421C000CU, 0x8U, 0x421C81D4U, 0x0U
#define IOMUXC_PIO2_3_HSP_XBAR0_INOUT03                                                       0x421C000CU, 0xAU, 0x421C82F4U, 0x0U
#define IOMUXC_PIO2_3_HSP_XBAR1_INOUT03                                                       0x421C000CU, 0xBU, 0x421C8364U, 0x0U
#define IOMUXC_PIO2_3_COMM_uSDHC1_TST_TRG                                                     0x421C000CU, 0xFU, 0x00000000U, 0x0U

