zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO2_4_HSP_GPIO0_GPIO4                                                         0x421C0010U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_4_HSP_LPUART1_CTS_B                                                       0x421C0010U, 0x1U, 0x421C826CU, 0x0U
#define IOMUXC_PIO2_4_HSP_FLEXIO0_FXIO_D04                                                    0x421C0010U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_4_AUDIO_SAI0_MCLK                                                         0x421C0010U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_4_HSP_eFlexPWM0_PWM_A2                                                    0x421C0010U, 0x4U, 0x421C8140U, 0x0U
#define IOMUXC_PIO2_4_MAIN_AHB_SRAMC_SRAMC_DA04                                               0x421C0010U, 0x5U, 0x421C83D8U, 0x0U
#define IOMUXC_PIO2_4_HSP_QTPM0_CH4                                                           0x421C0010U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_4_MEDIA_DCIF_DATA04                                                       0x421C0010U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_4_HSP_LPSPI0_PCS0                                                         0x421C0010U, 0x8U, 0x421C81DCU, 0x0U
#define IOMUXC_PIO2_4_MAIN_TRACE3                                                             0x421C0010U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_4_HSP_XBAR0_INOUT04                                                       0x421C0010U, 0xAU, 0x421C82F8U, 0x0U
#define IOMUXC_PIO2_4_HSP_XBAR1_INOUT04                                                       0x421C0010U, 0xBU, 0x421C8368U, 0x0U

#define IOMUXC_PIO2_5_HSP_GPIO0_GPIO5                                                         0x421C0014U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_5_HSP_LPUART1_RTS_B                                                       0x421C0014U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_5_HSP_FLEXIO0_FXIO_D05                                                    0x421C0014U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_5_AUDIO_SAI0_RX_BCLK                                                      0x421C0014U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_5_HSP_eFlexPWM0_PWM_B2                                                    0x421C0014U, 0x4U, 0x421C814CU, 0x0U
#define IOMUXC_PIO2_5_MAIN_AHB_SRAMC_SRAMC_DA05                                               0x421C0014U, 0x5U, 0x421C83DCU, 0x0U
#define IOMUXC_PIO2_5_HSP_QTPM0_CH5                                                           0x421C0014U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_5_MEDIA_DCIF_DATA05                                                       0x421C0014U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_5_HSP_LPSPI0_SOUT                                                         0x421C0014U, 0x8U, 0x421C81F4U, 0x0U
#define IOMUXC_PIO2_5_MAIN_TRACE2                                                             0x421C0014U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_5_HSP_XBAR0_INOUT05                                                       0x421C0014U, 0xAU, 0x421C82FCU, 0x0U
#define IOMUXC_PIO2_5_HSP_XBAR1_INOUT05                                                       0x421C0014U, 0xBU, 0x421C836CU, 0x0U

#define IOMUXC_PIO2_6_HSP_GPIO0_GPIO6                                                         0x421C0018U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_6_HSP_LPUART1_TXD                                                         0x421C0018U, 0x1U, 0x421C8274U, 0x0U
#define IOMUXC_PIO2_6_HSP_FLEXIO0_FXIO_D06                                                    0x421C0018U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_6_AUDIO_SAI0_RX_SYNC                                                      0x421C0018U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_6_HSP_eFlexPWM0_PWM_A3                                                    0x421C0018U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_6_MAIN_AHB_SRAMC_SRAMC_DA06                                               0x421C0018U, 0x5U, 0x421C83E0U, 0x0U
#define IOMUXC_PIO2_6_HSP_QTPM0_CH6                                                           0x421C0018U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_6_MEDIA_DCIF_DATA06                                                       0x421C0018U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_6_HSP_LPSPI0_SIN                                                          0x421C0018U, 0x8U, 0x421C81F0U, 0x0U
#define IOMUXC_PIO2_6_MAIN_TRACE1                                                             0x421C0018U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_6_HSP_XBAR0_INOUT06                                                       0x421C0018U, 0xAU, 0x421C8300U, 0x0U
#define IOMUXC_PIO2_6_HSP_XBAR1_INOUT06                                                       0x421C0018U, 0xBU, 0x421C8370U, 0x0U

#define IOMUXC_PIO2_7_HSP_GPIO0_GPIO7                                                         0x421C001CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_7_HSP_LPUART1_RXD                                                         0x421C001CU, 0x1U, 0x421C8270U, 0x0U
#define IOMUXC_PIO2_7_HSP_FLEXIO0_FXIO_D07                                                    0x421C001CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_7_AUDIO_SAI0_TX_DATA1                                                     0x421C001CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_7_HSP_eFlexPWM0_PWM_B3                                                    0x421C001CU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_7_MAIN_AHB_SRAMC_SRAMC_DA07                                               0x421C001CU, 0x5U, 0x421C83E4U, 0x0U
#define IOMUXC_PIO2_7_HSP_QTPM0_CH7                                                           0x421C001CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_7_MEDIA_DCIF_DATA07                                                       0x421C001CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_7_HSP_LPSPI0_SCK                                                          0x421C001CU, 0x8U, 0x421C81ECU, 0x0U
#define IOMUXC_PIO2_7_MAIN_TRACE0                                                             0x421C001CU, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_7_HSP_XBAR0_INOUT07                                                       0x421C001CU, 0xAU, 0x421C8304U, 0x0U
#define IOMUXC_PIO2_7_HSP_XBAR1_INOUT07                                                       0x421C001CU, 0xBU, 0x421C8374U, 0x0U

