zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO2_8_HSP_GPIO0_GPIO8                                                         0x421C0020U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_8_HSP_LPUART2_TXD                                                         0x421C0020U, 0x1U, 0x421C8280U, 0x0U
#define IOMUXC_PIO2_8_HSP_FLEXIO0_FXIO_D08                                                    0x421C0020U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_8_AUDIO_SAI0_RX_DATA1                                                     0x421C0020U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_8_HSP_SINC0_MCLK0                                                         0x421C0020U, 0x4U, 0x421C82B8U, 0x0U
#define IOMUXC_PIO2_8_MAIN_AHB_SRAMC_SRAMC_LBB                                                0x421C0020U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_8_HSP_SINC0_MCLK_OUT0                                                     0x421C0020U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_8_MEDIA_DCIF_DATA08                                                       0x421C0020U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_8_HSP_LPSPI0_PCS1                                                         0x421C0020U, 0x8U, 0x421C81E0U, 0x0U
#define IOMUXC_PIO2_8_MAIN_TRACE_CLK                                                          0x421C0020U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_8_HSP_XBAR0_INOUT08                                                       0x421C0020U, 0xAU, 0x421C8308U, 0x0U
#define IOMUXC_PIO2_8_HSP_XBAR1_INOUT08                                                       0x421C0020U, 0xBU, 0x421C8378U, 0x0U

#define IOMUXC_PIO2_9_HSP_GPIO0_GPIO9                                                         0x421C0024U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_9_HSP_LPUART2_RXD                                                         0x421C0024U, 0x1U, 0x421C827CU, 0x0U
#define IOMUXC_PIO2_9_HSP_FLEXIO0_FXIO_D09                                                    0x421C0024U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_9_AUDIO_SAI0_TX_DATA2                                                     0x421C0024U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_9_HSP_SINC0_MCLK1                                                         0x421C0024U, 0x4U, 0x421C82BCU, 0x0U
#define IOMUXC_PIO2_9_MAIN_AHB_SRAMC_SRAMC_DA08                                               0x421C0024U, 0x5U, 0x421C83E8U, 0x0U
#define IOMUXC_PIO2_9_HSP_SINC0_MCLK_OUT1                                                     0x421C0024U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_9_MEDIA_DCIF_DATA09                                                       0x421C0024U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_9_HSP_LPSPI0_PCS2                                                         0x421C0024U, 0x8U, 0x421C81E4U, 0x0U
#define IOMUXC_PIO2_9_HSP_XBAR0_INOUT09                                                       0x421C0024U, 0xAU, 0x421C830CU, 0x0U
#define IOMUXC_PIO2_9_HSP_XBAR1_INOUT09                                                       0x421C0024U, 0xBU, 0x421C837CU, 0x0U

#define IOMUXC_PIO2_10_HSP_GPIO0_GPIO10                                                       0x421C0028U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_10_HSP_LPUART2_CTS_B                                                      0x421C0028U, 0x1U, 0x421C8278U, 0x0U
#define IOMUXC_PIO2_10_HSP_FLEXIO0_FXIO_D10                                                   0x421C0028U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_10_AUDIO_SAI0_RX_DATA2                                                    0x421C0028U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_10_HSP_SINC0_MCLK2                                                        0x421C0028U, 0x4U, 0x421C82C0U, 0x0U
#define IOMUXC_PIO2_10_MAIN_AHB_SRAMC_SRAMC_DA09                                              0x421C0028U, 0x5U, 0x421C83ECU, 0x0U
#define IOMUXC_PIO2_10_HSP_SINC0_MCLK_OUT2                                                    0x421C0028U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_10_MEDIA_DCIF_DATA10                                                      0x421C0028U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_10_HSP_LPSPI0_PCS3                                                        0x421C0028U, 0x8U, 0x421C81E8U, 0x0U
#define IOMUXC_PIO2_10_HSP_XBAR0_INOUT10                                                      0x421C0028U, 0xAU, 0x421C8310U, 0x0U
#define IOMUXC_PIO2_10_HSP_XBAR1_INOUT10                                                      0x421C0028U, 0xBU, 0x421C8380U, 0x0U

#define IOMUXC_PIO2_11_HSP_GPIO0_GPIO11                                                       0x421C002CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_11_HSP_LPUART2_RTS_B                                                      0x421C002CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_11_HSP_FLEXIO0_FXIO_D11                                                   0x421C002CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_11_AUDIO_SAI0_TX_DATA3                                                    0x421C002CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_11_HSP_SINC0_MCLK3                                                        0x421C002CU, 0x4U, 0x421C82C4U, 0x0U
#define IOMUXC_PIO2_11_MAIN_AHB_SRAMC_SRAMC_DA10                                              0x421C002CU, 0x5U, 0x421C83F0U, 0x0U
#define IOMUXC_PIO2_11_MEDIA_DCIF_DATA11                                                      0x421C002CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_11_HSP_XBAR0_INOUT11                                                      0x421C002CU, 0xAU, 0x421C8314U, 0x0U
#define IOMUXC_PIO2_11_HSP_XBAR1_INOUT11                                                      0x421C002CU, 0xBU, 0x421C8384U, 0x0U

#define IOMUXC_PIO2_12_HSP_GPIO0_GPIO12                                                       0x421C0030U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_12_HSP_LPUART3_TXD                                                        0x421C0030U, 0x1U, 0x421C828CU, 0x0U
#define IOMUXC_PIO2_12_HSP_FLEXIO0_FXIO_D12                                                   0x421C0030U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_12_AUDIO_SAI0_RX_DATA3                                                    0x421C0030U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_12_HSP_SINC0_MBIT0                                                        0x421C0030U, 0x4U, 0x421C82A8U, 0x0U
#define IOMUXC_PIO2_12_MAIN_AHB_SRAMC_SRAMC_DA11                                              0x421C0030U, 0x5U, 0x421C83F4U, 0x0U
#define IOMUXC_PIO2_12_MEDIA_DCIF_DATA12                                                      0x421C0030U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_12_HSP_LPI2C0_SDA                                                         0x421C0030U, 0x8U, 0x421C81D0U, 0x1U
#define IOMUXC_PIO2_12_HSP_XBAR0_INOUT12                                                      0x421C0030U, 0xAU, 0x421C8318U, 0x0U
#define IOMUXC_PIO2_12_HSP_XBAR1_INOUT12                                                      0x421C0030U, 0xBU, 0x421C8388U, 0x0U

