zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO2_13_HSP_GPIO0_GPIO13                                                       0x421C0034U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_13_HSP_LPUART3_RXD                                                        0x421C0034U, 0x1U, 0x421C8288U, 0x0U
#define IOMUXC_PIO2_13_HSP_FLEXIO0_FXIO_D13                                                   0x421C0034U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_13_WAKE_EWM_OUT_B                                                         0x421C0034U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_13_HSP_SINC0_MBIT1                                                        0x421C0034U, 0x4U, 0x421C82ACU, 0x0U
#define IOMUXC_PIO2_13_MAIN_AHB_SRAMC_SRAMC_DA12                                              0x421C0034U, 0x5U, 0x421C83F8U, 0x0U
#define IOMUXC_PIO2_13_HSP_eFlexPWM0_PWM_X0                                                   0x421C0034U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_13_MEDIA_DCIF_DATA13                                                      0x421C0034U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_13_HSP_LPI2C0_SCL                                                         0x421C0034U, 0x8U, 0x421C81CCU, 0x1U
#define IOMUXC_PIO2_13_HSP_XBAR0_INOUT13                                                      0x421C0034U, 0xAU, 0x421C831CU, 0x0U
#define IOMUXC_PIO2_13_HSP_XBAR1_INOUT13                                                      0x421C0034U, 0xBU, 0x421C838CU, 0x0U

#define IOMUXC_PIO2_14_HSP_GPIO0_GPIO14                                                       0x421C0038U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_14_HSP_LPUART3_CTS_B                                                      0x421C0038U, 0x1U, 0x421C8284U, 0x0U
#define IOMUXC_PIO2_14_HSP_FLEXIO0_FXIO_D14                                                   0x421C0038U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_14_AUDIO_MICFIL_PDM_CLK                                                   0x421C0038U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_14_HSP_SINC0_MBIT2                                                        0x421C0038U, 0x4U, 0x421C82B0U, 0x0U
#define IOMUXC_PIO2_14_MAIN_AHB_SRAMC_SRAMC_DA13                                              0x421C0038U, 0x5U, 0x421C83FCU, 0x0U
#define IOMUXC_PIO2_14_HSP_eFlexPWM0_PWM_X1                                                   0x421C0038U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_14_MEDIA_DCIF_DATA14                                                      0x421C0038U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_14_HSP_FlexCAN0_CAN_TX                                                    0x421C0038U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_14_HSP_XBAR0_INOUT14                                                      0x421C0038U, 0xAU, 0x421C8320U, 0x0U
#define IOMUXC_PIO2_14_HSP_XBAR1_INOUT14                                                      0x421C0038U, 0xBU, 0x421C8390U, 0x0U

#define IOMUXC_PIO2_15_HSP_GPIO0_GPIO15                                                       0x421C003CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_15_HSP_LPUART3_RTS_B                                                      0x421C003CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_15_HSP_FLEXIO0_FXIO_D15                                                   0x421C003CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_15_AUDIO_MICFIL_PDM_DATA45                                                0x421C003CU, 0x3U, 0x421C8008U, 0x0U
#define IOMUXC_PIO2_15_HSP_SINC0_MBIT3                                                        0x421C003CU, 0x4U, 0x421C82B4U, 0x0U
#define IOMUXC_PIO2_15_MAIN_AHB_SRAMC_SRAMC_DA14                                              0x421C003CU, 0x5U, 0x421C8400U, 0x0U
#define IOMUXC_PIO2_15_HSP_eFlexPWM0_PWM_X2                                                   0x421C003CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_15_MEDIA_DCIF_DATA15                                                      0x421C003CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_15_HSP_FlexCAN0_CAN_RX                                                    0x421C003CU, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_15_HSP_XBAR0_INOUT15                                                      0x421C003CU, 0xAU, 0x421C8324U, 0x0U
#define IOMUXC_PIO2_15_HSP_XBAR1_INOUT15                                                      0x421C003CU, 0xBU, 0x421C8394U, 0x0U

#define IOMUXC_PIO2_16_HSP_GPIO0_GPIO16                                                       0x421C0040U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_16_HSP_LPUART4_TXD                                                        0x421C0040U, 0x1U, 0x421C8298U, 0x0U
#define IOMUXC_PIO2_16_HSP_FLEXIO0_FXIO_D16                                                   0x421C0040U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_16_AUDIO_MICFIL_PDM_DATA23                                                0x421C0040U, 0x3U, 0x421C8004U, 0x0U
#define IOMUXC_PIO2_16_HSP_SINC0_BREAK                                                        0x421C0040U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_16_MAIN_AHB_SRAMC_SRAMC_DA15                                              0x421C0040U, 0x5U, 0x421C8404U, 0x0U
#define IOMUXC_PIO2_16_HSP_eFlexPWM0_PWM_X3                                                   0x421C0040U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_16_MEDIA_DCIF_DATA16                                                      0x421C0040U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_16_HSP_FlexCAN1_CAN_TX                                                    0x421C0040U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_16_HSP_XBAR0_INOUT16                                                      0x421C0040U, 0xAU, 0x421C8328U, 0x0U
#define IOMUXC_PIO2_16_HSP_XBAR1_INOUT16                                                      0x421C0040U, 0xBU, 0x421C8398U, 0x0U

#define IOMUXC_PIO2_17_HSP_GPIO0_GPIO17                                                       0x421C0044U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_17_HSP_LPUART4_RXD                                                        0x421C0044U, 0x1U, 0x421C8294U, 0x0U
#define IOMUXC_PIO2_17_HSP_FLEXIO0_FXIO_D17                                                   0x421C0044U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_17_AUDIO_MICFIL_PDM_DATA01                                                0x421C0044U, 0x3U, 0x421C8000U, 0x0U
#define IOMUXC_PIO2_17_AUDIO_MQS_MQS_LEFT                                                     0x421C0044U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_17_MAIN_AHB_SRAMC_SRAMC_UBB                                               0x421C0044U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_17_AUDIO_SAI1_MCLK                                                        0x421C0044U, 0x6U, 0x421C800CU, 0x0U
#define IOMUXC_PIO2_17_MEDIA_DCIF_DATA17                                                      0x421C0044U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_17_HSP_FlexCAN1_CAN_RX                                                    0x421C0044U, 0x8U, 0x421C8110U, 0x0U
#define IOMUXC_PIO2_17_HSP_XBAR0_INOUT17                                                      0x421C0044U, 0xAU, 0x421C832CU, 0x0U
#define IOMUXC_PIO2_17_HSP_XBAR1_INOUT17                                                      0x421C0044U, 0xBU, 0x421C839CU, 0x0U

#define IOMUXC_PIO2_18_HSP_GPIO0_GPIO18                                                       0x421C0048U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_18_HSP_LPUART4_CTS_B                                                      0x421C0048U, 0x1U, 0x421C8290U, 0x0U
#define IOMUXC_PIO2_18_HSP_FLEXIO0_FXIO_D18                                                   0x421C0048U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_18_AUDIO_MQS_MQS_RIGHT                                                    0x421C0048U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_18_MAIN_AHB_SRAMC_SRAMC_WEB                                               0x421C0048U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_18_AUDIO_SAI1_TX_BCLK                                                     0x421C0048U, 0x6U, 0x421C8020U, 0x0U
#define IOMUXC_PIO2_18_MEDIA_DCIF_DATA18                                                      0x421C0048U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_18_HSP_XBAR0_INOUT18                                                      0x421C0048U, 0xAU, 0x421C8330U, 0x0U
#define IOMUXC_PIO2_18_HSP_XBAR1_INOUT18                                                      0x421C0048U, 0xBU, 0x421C83A0U, 0x0U

#define IOMUXC_PIO2_19_HSP_GPIO0_GPIO19                                                       0x421C004CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_19_HSP_LPUART4_RTS_B                                                      0x421C004CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_19_HSP_FLEXIO0_FXIO_D19                                                   0x421C004CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_19_HSP_eFlexPWM1_PWM_X0                                                   0x421C004CU, 0x4U, 0x421C8170U, 0x0U
#define IOMUXC_PIO2_19_MAIN_AHB_SRAMC_SRAMC_OEB                                               0x421C004CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_19_AUDIO_SAI1_TX_SYNC                                                     0x421C004CU, 0x6U, 0x421C8024U, 0x0U
#define IOMUXC_PIO2_19_MEDIA_DCIF_DATA19                                                      0x421C004CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_19_HSP_XBAR0_INOUT19                                                      0x421C004CU, 0xAU, 0x421C8334U, 0x0U
#define IOMUXC_PIO2_19_HSP_XBAR1_INOUT19                                                      0x421C004CU, 0xBU, 0x421C83A4U, 0x0U

#define IOMUXC_PIO2_20_HSP_GPIO0_GPIO20                                                       0x421C0050U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_20_HSP_LPUART5_TXD                                                        0x421C0050U, 0x1U, 0x421C82A4U, 0x0U
#define IOMUXC_PIO2_20_HSP_FLEXIO0_FXIO_D20                                                   0x421C0050U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_20_COMM_USB0_PWR                                                          0x421C0050U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_20_HSP_eFlexPWM1_PWM_A3                                                   0x421C0050U, 0x4U, 0x421C815CU, 0x0U
#define IOMUXC_PIO2_20_MAIN_AHB_SRAMC_SRAMC_WP0                                               0x421C0050U, 0x5U, 0x421C8408U, 0x0U
#define IOMUXC_PIO2_20_AUDIO_SAI1_TX_DATA0                                                    0x421C0050U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_20_MEDIA_DCIF_DATA20                                                      0x421C0050U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_20_HSP_XBAR0_INOUT20                                                      0x421C0050U, 0xAU, 0x421C8338U, 0x0U
#define IOMUXC_PIO2_20_HSP_XBAR1_INOUT20                                                      0x421C0050U, 0xBU, 0x421C83A8U, 0x0U

#define IOMUXC_PIO2_21_HSP_GPIO0_GPIO21                                                       0x421C0054U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_21_HSP_LPUART5_RXD                                                        0x421C0054U, 0x1U, 0x421C82A0U, 0x0U
#define IOMUXC_PIO2_21_HSP_FLEXIO0_FXIO_D21                                                   0x421C0054U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_21_COMM_USB0_OC                                                           0x421C0054U, 0x3U, 0x421C80A8U, 0x0U
#define IOMUXC_PIO2_21_HSP_eFlexPWM1_PWM_B3                                                   0x421C0054U, 0x4U, 0x421C816CU, 0x0U
#define IOMUXC_PIO2_21_MAIN_AHB_SRAMC_SRAMC_WP1                                               0x421C0054U, 0x5U, 0x421C840CU, 0x0U
#define IOMUXC_PIO2_21_AUDIO_SAI1_RX_DATA0                                                    0x421C0054U, 0x6U, 0x421C8014U, 0x0U
#define IOMUXC_PIO2_21_MEDIA_DCIF_DATA21                                                      0x421C0054U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_21_HSP_LPSPI1_PCS3                                                        0x421C0054U, 0x9U, 0x421C8204U, 0x0U
#define IOMUXC_PIO2_21_HSP_XBAR0_INOUT21                                                      0x421C0054U, 0xAU, 0x421C833CU, 0x0U
#define IOMUXC_PIO2_21_HSP_XBAR1_INOUT21                                                      0x421C0054U, 0xBU, 0x421C83ACU, 0x0U

#define IOMUXC_PIO2_22_HSP_GPIO0_GPIO22                                                       0x421C0058U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_22_HSP_LPUART5_CTS_B                                                      0x421C0058U, 0x1U, 0x421C829CU, 0x0U
#define IOMUXC_PIO2_22_HSP_FLEXIO0_FXIO_D22                                                   0x421C0058U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_22_COMM_USB0_ID                                                           0x421C0058U, 0x3U, 0x421C80ACU, 0x0U
#define IOMUXC_PIO2_22_HSP_eFlexPWM1_PWM_A2                                                   0x421C0058U, 0x4U, 0x421C8158U, 0x0U
#define IOMUXC_PIO2_22_MAIN_XSPI0_ECS                                                         0x421C0058U, 0x5U, 0x421C8410U, 0x0U
#define IOMUXC_PIO2_22_AUDIO_SAI1_MCLK                                                        0x421C0058U, 0x6U, 0x421C800CU, 0x1U
#define IOMUXC_PIO2_22_MEDIA_DCIF_DATA22                                                      0x421C0058U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_22_HSP_LPSPI1_PCS2                                                        0x421C0058U, 0x9U, 0x421C8200U, 0x0U
#define IOMUXC_PIO2_22_HSP_XBAR0_INOUT22                                                      0x421C0058U, 0xAU, 0x421C8340U, 0x0U
#define IOMUXC_PIO2_22_HSP_XBAR1_INOUT22                                                      0x421C0058U, 0xBU, 0x421C83B0U, 0x0U

#define IOMUXC_PIO2_23_HSP_GPIO0_GPIO23                                                       0x421C005CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_23_HSP_LPUART5_RTS_B                                                      0x421C005CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_23_HSP_FLEXIO0_FXIO_D23                                                   0x421C005CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_23_MAIN_TRACE_SWO                                                         0x421C005CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_23_HSP_eFlexPWM1_PWM_B2                                                   0x421C005CU, 0x4U, 0x421C8168U, 0x0U
#define IOMUXC_PIO2_23_HSP_eFlexPWM1_PWM_X0                                                   0x421C005CU, 0x5U, 0x421C8170U, 0x1U
#define IOMUXC_PIO2_23_AUDIO_SAI1_RX_BCLK                                                     0x421C005CU, 0x6U, 0x421C8010U, 0x0U
#define IOMUXC_PIO2_23_MEDIA_DCIF_DATA23                                                      0x421C005CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_23_HSP_LPSPI1_PCS1                                                        0x421C005CU, 0x9U, 0x421C81FCU, 0x0U
#define IOMUXC_PIO2_23_HSP_XBAR0_INOUT23                                                      0x421C005CU, 0xAU, 0x421C8344U, 0x0U
#define IOMUXC_PIO2_23_HSP_XBAR1_INOUT23                                                      0x421C005CU, 0xBU, 0x421C83B4U, 0x0U

#define IOMUXC_PIO2_24_HSP_GPIO0_GPIO24                                                       0x421C0060U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_24_HSP_LPI2C1_SDA                                                         0x421C0060U, 0x1U, 0x421C81D8U, 0x1U
#define IOMUXC_PIO2_24_HSP_FLEXIO0_FXIO_D24                                                   0x421C0060U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_24_HSP_I3C_SDA                                                            0x421C0060U, 0x3U, 0x421C81C8U, 0x0U
#define IOMUXC_PIO2_24_HSP_eFlexPWM1_PWM_A1                                                   0x421C0060U, 0x4U, 0x421C8154U, 0x0U
#define IOMUXC_PIO2_24_AUDIO_SPDIF_IN                                                         0x421C0060U, 0x5U, 0x421C8044U, 0x0U
#define IOMUXC_PIO2_24_AUDIO_SAI1_RX_SYNC                                                     0x421C0060U, 0x6U, 0x421C801CU, 0x0U
#define IOMUXC_PIO2_24_MEDIA_DCIF_HSYNC                                                       0x421C0060U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_24_HSP_LPSPI1_PCS0                                                        0x421C0060U, 0x9U, 0x421C81F8U, 0x0U
#define IOMUXC_PIO2_24_HSP_XBAR0_INOUT24                                                      0x421C0060U, 0xAU, 0x421C8348U, 0x0U
#define IOMUXC_PIO2_24_HSP_XBAR1_INOUT24                                                      0x421C0060U, 0xBU, 0x421C83B8U, 0x0U

