zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO2_25_HSP_GPIO0_GPIO25                                                       0x421C0064U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_25_HSP_LPI2C1_SCL                                                         0x421C0064U, 0x1U, 0x421C81D4U, 0x1U
#define IOMUXC_PIO2_25_HSP_FLEXIO0_FXIO_D25                                                   0x421C0064U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_25_HSP_I3C_SCL                                                            0x421C0064U, 0x3U, 0x421C81C4U, 0x0U
#define IOMUXC_PIO2_25_HSP_eFlexPWM1_PWM_B1                                                   0x421C0064U, 0x4U, 0x421C8164U, 0x0U
#define IOMUXC_PIO2_25_AUDIO_SPDIF_OUT                                                        0x421C0064U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_25_AUDIO_SAI1_TX_DATA1                                                    0x421C0064U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_25_MEDIA_DCIF_VSYNC                                                       0x421C0064U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_25_HSP_FlexCAN1_CAN_TX                                                    0x421C0064U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_25_HSP_LPSPI1_SCK                                                         0x421C0064U, 0x9U, 0x421C8208U, 0x0U
#define IOMUXC_PIO2_25_HSP_XBAR0_INOUT25                                                      0x421C0064U, 0xAU, 0x421C834CU, 0x0U
#define IOMUXC_PIO2_25_HSP_XBAR1_INOUT25                                                      0x421C0064U, 0xBU, 0x421C83BCU, 0x0U

#define IOMUXC_PIO2_26_HSP_GPIO0_GPIO26                                                       0x421C0068U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_26_HSP_FLEXIO0_FXIO_D26                                                   0x421C0068U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_26_HSP_I3C_PUR                                                            0x421C0068U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_26_HSP_eFlexPWM1_PWM_A0                                                   0x421C0068U, 0x4U, 0x421C8150U, 0x0U
#define IOMUXC_PIO2_26_AUDIO_MQS_MQS_LEFT                                                     0x421C0068U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_26_AUDIO_SAI1_RX_DATA1                                                    0x421C0068U, 0x6U, 0x421C8018U, 0x0U
#define IOMUXC_PIO2_26_MEDIA_DCIF_DE                                                          0x421C0068U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_26_HSP_FlexCAN1_CAN_RX                                                    0x421C0068U, 0x8U, 0x421C8110U, 0x1U
#define IOMUXC_PIO2_26_HSP_LPSPI1_SIN                                                         0x421C0068U, 0x9U, 0x421C820CU, 0x0U
#define IOMUXC_PIO2_26_HSP_XBAR0_INOUT26                                                      0x421C0068U, 0xAU, 0x421C8350U, 0x0U
#define IOMUXC_PIO2_26_HSP_XBAR1_INOUT26                                                      0x421C0068U, 0xBU, 0x421C83C0U, 0x0U

#define IOMUXC_PIO2_27_HSP_GPIO0_GPIO27                                                       0x421C006CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_27_HSP_FLEXIO0_FXIO_D27                                                   0x421C006CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_27_COMM_CCM_CLKREF_25M                                                    0x421C006CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_27_HSP_eFlexPWM1_PWM_B0                                                   0x421C006CU, 0x4U, 0x421C8160U, 0x0U
#define IOMUXC_PIO2_27_AUDIO_MQS_MQS_RIGHT                                                    0x421C006CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_27_COMM_USB1_VBUS_GPIO                                                    0x421C006CU, 0x6U, 0x421C80B0U, 0x0U
#define IOMUXC_PIO2_27_MEDIA_DCIF_PIXEL_CLK                                                   0x421C006CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_27_HSP_LPSPI1_SOUT                                                        0x421C006CU, 0x9U, 0x421C8210U, 0x0U
#define IOMUXC_PIO2_27_HSP_XBAR0_INOUT27                                                      0x421C006CU, 0xAU, 0x421C8354U, 0x0U
#define IOMUXC_PIO2_27_HSP_XBAR1_INOUT27                                                      0x421C006CU, 0xBU, 0x421C83C4U, 0x0U

#define IOMUXC_PIO3_0_HSP_GPIO1_GPIO0                                                         0x421C0080U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_0_COMM_ENET_QOS_TX_CLK_IO                                                 0x421C0080U, 0x1U, 0x421C8050U, 0x0U
#define IOMUXC_PIO3_0_HSP_FLEXIO1_FXIO_D00                                                    0x421C0080U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_0_MEDIA_CSI_DATA00                                                        0x421C0080U, 0x4U, 0x421C8414U, 0x0U
#define IOMUXC_PIO3_0_MAIN_AHB_SRAMC_SRAMC_ADDR00                                             0x421C0080U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_0_MEDIA_DCIF_DATA00                                                       0x421C0080U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_0_MEDIA_DCIF_DBI_AB_DATA00                                                0x421C0080U, 0x7U, 0x421C8460U, 0x0U
#define IOMUXC_PIO3_0_HSP_eFlexPWM1_PWM_A0                                                    0x421C0080U, 0x8U, 0x421C8150U, 0x1U
#define IOMUXC_PIO3_0_COMM_ENET_QOS_REF_CLK                                                   0x421C0080U, 0x9U, 0x421C8048U, 0x0U
#define IOMUXC_PIO3_0_HSP_XBAR0_INOUT00                                                       0x421C0080U, 0xAU, 0x421C82E8U, 0x1U
#define IOMUXC_PIO3_0_HSP_XBAR1_INOUT00                                                       0x421C0080U, 0xBU, 0x421C8358U, 0x1U

#define IOMUXC_PIO3_1_HSP_GPIO1_GPIO1                                                         0x421C0084U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_1_COMM_ENET_QOS_TX_DATA0                                                  0x421C0084U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_1_HSP_FLEXIO1_FXIO_D01                                                    0x421C0084U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_1_MEDIA_CSI_DATA01                                                        0x421C0084U, 0x4U, 0x421C8418U, 0x0U
#define IOMUXC_PIO3_1_MAIN_AHB_SRAMC_SRAMC_ADDR01                                             0x421C0084U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_1_MEDIA_DCIF_DATA01                                                       0x421C0084U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_1_MEDIA_DCIF_DBI_AB_DATA01                                                0x421C0084U, 0x7U, 0x421C8464U, 0x0U
#define IOMUXC_PIO3_1_HSP_eFlexPWM1_PWM_B0                                                    0x421C0084U, 0x8U, 0x421C8160U, 0x1U
#define IOMUXC_PIO3_1_HSP_XBAR0_INOUT01                                                       0x421C0084U, 0xAU, 0x421C82ECU, 0x1U
#define IOMUXC_PIO3_1_HSP_XBAR1_INOUT01                                                       0x421C0084U, 0xBU, 0x421C835CU, 0x1U

#define IOMUXC_PIO3_2_HSP_GPIO1_GPIO2                                                         0x421C0088U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_2_COMM_ENET_QOS_TX_DATA1                                                  0x421C0088U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_2_HSP_FLEXIO1_FXIO_D02                                                    0x421C0088U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_2_COMM_TENBASET_PHY0_TX                                                   0x421C0088U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_2_MEDIA_CSI_DATA02                                                        0x421C0088U, 0x4U, 0x421C841CU, 0x0U
#define IOMUXC_PIO3_2_MAIN_AHB_SRAMC_SRAMC_ADDR02                                             0x421C0088U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_2_MEDIA_DCIF_DATA02                                                       0x421C0088U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_2_MEDIA_DCIF_DBI_AB_DATA02                                                0x421C0088U, 0x7U, 0x421C8468U, 0x0U
#define IOMUXC_PIO3_2_HSP_eFlexPWM1_PWM_A1                                                    0x421C0088U, 0x8U, 0x421C8154U, 0x1U
#define IOMUXC_PIO3_2_HSP_LPUART0_TXD                                                         0x421C0088U, 0x9U, 0x421C8268U, 0x1U
#define IOMUXC_PIO3_2_HSP_XBAR0_INOUT02                                                       0x421C0088U, 0xAU, 0x421C82F0U, 0x1U
#define IOMUXC_PIO3_2_HSP_XBAR1_INOUT02                                                       0x421C0088U, 0xBU, 0x421C8360U, 0x1U

#define IOMUXC_PIO3_3_HSP_GPIO1_GPIO3                                                         0x421C008CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_3_COMM_ENET_QOS_TX_EN                                                     0x421C008CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_3_HSP_FLEXIO1_FXIO_D03                                                    0x421C008CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_3_MAIN_XSPI0_ECS                                                          0x421C008CU, 0x3U, 0x421C8410U, 0x1U
#define IOMUXC_PIO3_3_MEDIA_CSI_DATA03                                                        0x421C008CU, 0x4U, 0x421C8420U, 0x0U
#define IOMUXC_PIO3_3_MAIN_AHB_SRAMC_SRAMC_ADDR03                                             0x421C008CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_3_MEDIA_DCIF_DATA03                                                       0x421C008CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_3_MEDIA_DCIF_DBI_AB_DATA03                                                0x421C008CU, 0x7U, 0x421C846CU, 0x0U
#define IOMUXC_PIO3_3_HSP_eFlexPWM1_PWM_B1                                                    0x421C008CU, 0x8U, 0x421C8164U, 0x1U
#define IOMUXC_PIO3_3_HSP_LPUART0_RXD                                                         0x421C008CU, 0x9U, 0x421C8264U, 0x1U
#define IOMUXC_PIO3_3_HSP_XBAR0_INOUT03                                                       0x421C008CU, 0xAU, 0x421C82F4U, 0x1U
#define IOMUXC_PIO3_3_HSP_XBAR1_INOUT03                                                       0x421C008CU, 0xBU, 0x421C8364U, 0x1U

#define IOMUXC_PIO3_4_HSP_GPIO1_GPIO4                                                         0x421C0090U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_4_COMM_ENET_QOS_RX_DATA0                                                  0x421C0090U, 0x1U, 0x421C8060U, 0x0U
#define IOMUXC_PIO3_4_HSP_FLEXIO1_FXIO_D04                                                    0x421C0090U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_4_AUDIO_MICFIL_PDM_CLK                                                    0x421C0090U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_4_MEDIA_CSI_DATA04                                                        0x421C0090U, 0x4U, 0x421C8424U, 0x0U
#define IOMUXC_PIO3_4_MAIN_AHB_SRAMC_SRAMC_ADDR04                                             0x421C0090U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_4_MEDIA_DCIF_DATA04                                                       0x421C0090U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_4_MEDIA_DCIF_DBI_AB_DATA04                                                0x421C0090U, 0x7U, 0x421C8470U, 0x0U
#define IOMUXC_PIO3_4_HSP_eFlexPWM1_PWM_A2                                                    0x421C0090U, 0x8U, 0x421C8158U, 0x1U
#define IOMUXC_PIO3_4_HSP_LPUART0_CTS_B                                                       0x421C0090U, 0x9U, 0x421C8260U, 0x1U
#define IOMUXC_PIO3_4_HSP_XBAR0_INOUT04                                                       0x421C0090U, 0xAU, 0x421C82F8U, 0x1U
#define IOMUXC_PIO3_4_HSP_XBAR1_INOUT04                                                       0x421C0090U, 0xBU, 0x421C8368U, 0x1U

#define IOMUXC_PIO3_5_HSP_GPIO1_GPIO5                                                         0x421C0094U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_5_COMM_ENET_QOS_RX_DATA1                                                  0x421C0094U, 0x1U, 0x421C8064U, 0x0U
#define IOMUXC_PIO3_5_HSP_FLEXIO1_FXIO_D05                                                    0x421C0094U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_5_AUDIO_MICFIL_PDM_DATA45                                                 0x421C0094U, 0x3U, 0x421C8008U, 0x1U
#define IOMUXC_PIO3_5_MEDIA_CSI_DATA05                                                        0x421C0094U, 0x4U, 0x421C8428U, 0x0U
#define IOMUXC_PIO3_5_MAIN_AHB_SRAMC_SRAMC_ADDR05                                             0x421C0094U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_5_MEDIA_DCIF_DATA05                                                       0x421C0094U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_5_MEDIA_DCIF_DBI_AB_DATA05                                                0x421C0094U, 0x7U, 0x421C8474U, 0x0U
#define IOMUXC_PIO3_5_HSP_eFlexPWM1_PWM_B2                                                    0x421C0094U, 0x8U, 0x421C8168U, 0x1U
#define IOMUXC_PIO3_5_HSP_LPUART0_RTS_B                                                       0x421C0094U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_5_HSP_XBAR0_INOUT05                                                       0x421C0094U, 0xAU, 0x421C82FCU, 0x1U
#define IOMUXC_PIO3_5_HSP_XBAR1_INOUT05                                                       0x421C0094U, 0xBU, 0x421C836CU, 0x1U

#define IOMUXC_PIO3_6_HSP_GPIO1_GPIO6                                                         0x421C0098U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_6_COMM_ENET_QOS_CRS                                                       0x421C0098U, 0x1U, 0x421C805CU, 0x0U
#define IOMUXC_PIO3_6_HSP_FLEXIO1_FXIO_D06                                                    0x421C0098U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_6_AUDIO_MICFIL_PDM_DATA23                                                 0x421C0098U, 0x3U, 0x421C8004U, 0x1U
#define IOMUXC_PIO3_6_MEDIA_CSI_DATA06                                                        0x421C0098U, 0x4U, 0x421C842CU, 0x0U
#define IOMUXC_PIO3_6_MAIN_AHB_SRAMC_SRAMC_ADDR06                                             0x421C0098U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_6_MEDIA_DCIF_DATA06                                                       0x421C0098U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_6_MEDIA_DCIF_DBI_AB_DATA06                                                0x421C0098U, 0x7U, 0x421C8478U, 0x0U
#define IOMUXC_PIO3_6_HSP_eFlexPWM1_PWM_A3                                                    0x421C0098U, 0x8U, 0x421C815CU, 0x1U
#define IOMUXC_PIO3_6_HSP_LPUART1_CTS_B                                                       0x421C0098U, 0x9U, 0x421C826CU, 0x1U
#define IOMUXC_PIO3_6_HSP_XBAR0_INOUT06                                                       0x421C0098U, 0xAU, 0x421C8300U, 0x1U
#define IOMUXC_PIO3_6_HSP_XBAR1_INOUT06                                                       0x421C0098U, 0xBU, 0x421C8370U, 0x1U

#define IOMUXC_PIO3_7_HSP_GPIO1_GPIO7                                                         0x421C009CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_7_COMM_ENET_QOS_RXER                                                      0x421C009CU, 0x1U, 0x421C8074U, 0x0U
#define IOMUXC_PIO3_7_HSP_FLEXIO1_FXIO_D07                                                    0x421C009CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_7_AUDIO_MICFIL_PDM_DATA01                                                 0x421C009CU, 0x3U, 0x421C8000U, 0x1U
#define IOMUXC_PIO3_7_MEDIA_CSI_DATA07                                                        0x421C009CU, 0x4U, 0x421C8430U, 0x0U
#define IOMUXC_PIO3_7_MAIN_AHB_SRAMC_SRAMC_ADDR07                                             0x421C009CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_7_MEDIA_DCIF_DATA07                                                       0x421C009CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_7_MEDIA_DCIF_DBI_AB_DATA07                                                0x421C009CU, 0x7U, 0x421C847CU, 0x0U
#define IOMUXC_PIO3_7_HSP_eFlexPWM1_PWM_B3                                                    0x421C009CU, 0x8U, 0x421C816CU, 0x1U
#define IOMUXC_PIO3_7_HSP_LPUART1_RTS_B                                                       0x421C009CU, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_7_HSP_XBAR0_INOUT07                                                       0x421C009CU, 0xAU, 0x421C8304U, 0x1U
#define IOMUXC_PIO3_7_HSP_XBAR1_INOUT07                                                       0x421C009CU, 0xBU, 0x421C8374U, 0x1U

#define IOMUXC_PIO3_8_HSP_GPIO1_GPIO8                                                         0x421C00A0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_8_COMM_ENET_QOS_MDIO                                                      0x421C00A0U, 0x1U, 0x421C8054U, 0x0U
#define IOMUXC_PIO3_8_HSP_FLEXIO1_FXIO_D08                                                    0x421C00A0U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_8_COMM_TENBASET_PHY0_ED                                                   0x421C00A0U, 0x3U, 0x421C80D4U, 0x0U
#define IOMUXC_PIO3_8_MEDIA_CSI_DATA08                                                        0x421C00A0U, 0x4U, 0x421C8434U, 0x0U
#define IOMUXC_PIO3_8_MAIN_AHB_SRAMC_SRAMC_ADDR08                                             0x421C00A0U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_8_MEDIA_DCIF_DATA08                                                       0x421C00A0U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_8_MEDIA_DCIF_DBI_AB_DATA08                                                0x421C00A0U, 0x7U, 0x421C8480U, 0x0U
#define IOMUXC_PIO3_8_HSP_LPI2C1_SDA                                                          0x421C00A0U, 0x8U, 0x421C81D8U, 0x2U
#define IOMUXC_PIO3_8_HSP_LPUART1_TXD                                                         0x421C00A0U, 0x9U, 0x421C8274U, 0x1U
#define IOMUXC_PIO3_8_HSP_XBAR0_INOUT08                                                       0x421C00A0U, 0xAU, 0x421C8308U, 0x1U
#define IOMUXC_PIO3_8_HSP_XBAR1_INOUT08                                                       0x421C00A0U, 0xBU, 0x421C8378U, 0x1U
#define IOMUXC_PIO3_8_HSP_eFlexPWM2_PWM_A0                                                    0x421C00A0U, 0xCU, 0x421C8174U, 0x0U

