zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO3_9_HSP_GPIO1_GPIO9                                                         0x421C00A4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_9_COMM_ENET_QOS_MDC                                                       0x421C00A4U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_9_HSP_FLEXIO1_FXIO_D09                                                    0x421C00A4U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_9_COMM_TENBASET_PHY0_RX                                                   0x421C00A4U, 0x3U, 0x421C80D8U, 0x0U
#define IOMUXC_PIO3_9_MEDIA_CSI_DATA09                                                        0x421C00A4U, 0x4U, 0x421C8438U, 0x0U
#define IOMUXC_PIO3_9_MAIN_AHB_SRAMC_SRAMC_ADDR09                                             0x421C00A4U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_9_MEDIA_DCIF_DATA09                                                       0x421C00A4U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_9_MEDIA_DCIF_DBI_AB_DATA09                                                0x421C00A4U, 0x7U, 0x421C8484U, 0x0U
#define IOMUXC_PIO3_9_HSP_LPI2C1_SCL                                                          0x421C00A4U, 0x8U, 0x421C81D4U, 0x2U
#define IOMUXC_PIO3_9_HSP_LPUART1_RXD                                                         0x421C00A4U, 0x9U, 0x421C8270U, 0x1U
#define IOMUXC_PIO3_9_HSP_XBAR0_INOUT09                                                       0x421C00A4U, 0xAU, 0x421C830CU, 0x1U
#define IOMUXC_PIO3_9_HSP_XBAR1_INOUT09                                                       0x421C00A4U, 0xBU, 0x421C837CU, 0x1U
#define IOMUXC_PIO3_9_HSP_eFlexPWM2_PWM_B0                                                    0x421C00A4U, 0xCU, 0x421C8184U, 0x0U

#define IOMUXC_PIO3_10_HSP_GPIO1_GPIO10                                                       0x421C00A8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_10_COMM_ENET_QOS_TX_DATA2                                                 0x421C00A8U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_10_HSP_FLEXIO1_FXIO_D10                                                   0x421C00A8U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_10_AUDIO_SAI1_MCLK                                                        0x421C00A8U, 0x3U, 0x421C800CU, 0x2U
#define IOMUXC_PIO3_10_MEDIA_CSI_DATA10                                                       0x421C00A8U, 0x4U, 0x421C843CU, 0x0U
#define IOMUXC_PIO3_10_MAIN_AHB_SRAMC_SRAMC_ADDR10                                            0x421C00A8U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_10_MEDIA_DCIF_DATA10                                                      0x421C00A8U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_10_MEDIA_DCIF_DBI_AB_DATA10                                               0x421C00A8U, 0x7U, 0x421C8488U, 0x0U
#define IOMUXC_PIO3_10_HSP_LPSPI1_PCS3                                                        0x421C00A8U, 0x8U, 0x421C8204U, 0x1U
#define IOMUXC_PIO3_10_HSP_LPUART2_CTS_B                                                      0x421C00A8U, 0x9U, 0x421C8278U, 0x1U
#define IOMUXC_PIO3_10_HSP_XBAR0_INOUT10                                                      0x421C00A8U, 0xAU, 0x421C8310U, 0x1U
#define IOMUXC_PIO3_10_HSP_XBAR1_INOUT10                                                      0x421C00A8U, 0xBU, 0x421C8380U, 0x1U
#define IOMUXC_PIO3_10_HSP_eFlexPWM2_PWM_A1                                                   0x421C00A8U, 0xCU, 0x421C8178U, 0x0U

#define IOMUXC_PIO3_11_HSP_GPIO1_GPIO11                                                       0x421C00ACU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_11_COMM_ENET_QOS_TX_DATA3                                                 0x421C00ACU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_11_HSP_FLEXIO1_FXIO_D11                                                   0x421C00ACU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_11_AUDIO_SAI1_TX_BCLK                                                     0x421C00ACU, 0x3U, 0x421C8020U, 0x1U
#define IOMUXC_PIO3_11_MEDIA_CSI_DATA11                                                       0x421C00ACU, 0x4U, 0x421C8440U, 0x0U
#define IOMUXC_PIO3_11_MAIN_AHB_SRAMC_SRAMC_ADDR11                                            0x421C00ACU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_11_MEDIA_DCIF_DATA11                                                      0x421C00ACU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_11_MEDIA_DCIF_DBI_AB_DATA11                                               0x421C00ACU, 0x7U, 0x421C848CU, 0x0U
#define IOMUXC_PIO3_11_HSP_LPSPI1_PCS2                                                        0x421C00ACU, 0x8U, 0x421C8200U, 0x1U
#define IOMUXC_PIO3_11_HSP_LPUART2_RTS_B                                                      0x421C00ACU, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_11_HSP_XBAR0_INOUT11                                                      0x421C00ACU, 0xAU, 0x421C8314U, 0x1U
#define IOMUXC_PIO3_11_HSP_XBAR1_INOUT11                                                      0x421C00ACU, 0xBU, 0x421C8384U, 0x1U
#define IOMUXC_PIO3_11_HSP_eFlexPWM2_PWM_B1                                                   0x421C00ACU, 0xCU, 0x421C8188U, 0x0U

#define IOMUXC_PIO3_12_HSP_GPIO1_GPIO12                                                       0x421C00B0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_12_COMM_ENET_QOS_TX_ER                                                    0x421C00B0U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_12_HSP_FLEXIO1_FXIO_D12                                                   0x421C00B0U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_12_AUDIO_SAI1_TX_SYNC                                                     0x421C00B0U, 0x3U, 0x421C8024U, 0x1U
#define IOMUXC_PIO3_12_MEDIA_CSI_DATA12                                                       0x421C00B0U, 0x4U, 0x421C8444U, 0x0U
#define IOMUXC_PIO3_12_MAIN_AHB_SRAMC_SRAMC_ADDR12                                            0x421C00B0U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_12_MEDIA_DCIF_DATA12                                                      0x421C00B0U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_12_MEDIA_DCIF_DBI_AB_DATA12                                               0x421C00B0U, 0x7U, 0x421C8490U, 0x0U
#define IOMUXC_PIO3_12_HSP_LPSPI1_PCS1                                                        0x421C00B0U, 0x8U, 0x421C81FCU, 0x1U
#define IOMUXC_PIO3_12_HSP_LPUART2_TXD                                                        0x421C00B0U, 0x9U, 0x421C8280U, 0x1U
#define IOMUXC_PIO3_12_HSP_XBAR0_INOUT12                                                      0x421C00B0U, 0xAU, 0x421C8318U, 0x1U
#define IOMUXC_PIO3_12_HSP_XBAR1_INOUT12                                                      0x421C00B0U, 0xBU, 0x421C8388U, 0x1U
#define IOMUXC_PIO3_12_HSP_eFlexPWM2_PWM_A3                                                   0x421C00B0U, 0xCU, 0x421C8180U, 0x0U

