zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO3_13_HSP_GPIO1_GPIO13                                                       0x421C00B4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_13_COMM_ENET_QOS_RX_CLK                                                   0x421C00B4U, 0x1U, 0x421C804CU, 0x0U
#define IOMUXC_PIO3_13_HSP_FLEXIO1_FXIO_D13                                                   0x421C00B4U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_13_AUDIO_SAI1_TX_DATA0                                                    0x421C00B4U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_13_MEDIA_CSI_DATA13                                                       0x421C00B4U, 0x4U, 0x421C8448U, 0x0U
#define IOMUXC_PIO3_13_MAIN_AHB_SRAMC_SRAMC_ADDR13                                            0x421C00B4U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_13_MEDIA_DCIF_DATA13                                                      0x421C00B4U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_13_MEDIA_DCIF_DBI_AB_DATA13                                               0x421C00B4U, 0x7U, 0x421C8494U, 0x0U
#define IOMUXC_PIO3_13_HSP_LPSPI1_PCS0                                                        0x421C00B4U, 0x8U, 0x421C81F8U, 0x1U
#define IOMUXC_PIO3_13_HSP_LPUART2_RXD                                                        0x421C00B4U, 0x9U, 0x421C827CU, 0x1U
#define IOMUXC_PIO3_13_HSP_XBAR0_INOUT13                                                      0x421C00B4U, 0xAU, 0x421C831CU, 0x1U
#define IOMUXC_PIO3_13_HSP_XBAR1_INOUT13                                                      0x421C00B4U, 0xBU, 0x421C838CU, 0x1U
#define IOMUXC_PIO3_13_HSP_eFlexPWM2_PWM_B3                                                   0x421C00B4U, 0xCU, 0x421C8190U, 0x0U

#define IOMUXC_PIO3_14_HSP_GPIO1_GPIO14                                                       0x421C00B8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_14_COMM_ENET_QOS_RX_DATA2                                                 0x421C00B8U, 0x1U, 0x421C8068U, 0x0U
#define IOMUXC_PIO3_14_HSP_FLEXIO1_FXIO_D14                                                   0x421C00B8U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_14_AUDIO_SAI1_RX_DATA0                                                    0x421C00B8U, 0x3U, 0x421C8014U, 0x1U
#define IOMUXC_PIO3_14_MEDIA_CSI_DATA14                                                       0x421C00B8U, 0x4U, 0x421C844CU, 0x0U
#define IOMUXC_PIO3_14_MAIN_AHB_SRAMC_SRAMC_ADDR14                                            0x421C00B8U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_14_MEDIA_DCIF_DATA14                                                      0x421C00B8U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_14_MEDIA_DCIF_DBI_AB_DATA14                                               0x421C00B8U, 0x7U, 0x421C8498U, 0x0U
#define IOMUXC_PIO3_14_HSP_LPSPI1_SCK                                                         0x421C00B8U, 0x8U, 0x421C8208U, 0x1U
#define IOMUXC_PIO3_14_HSP_LPUART3_CTS_B                                                      0x421C00B8U, 0x9U, 0x421C8284U, 0x1U
#define IOMUXC_PIO3_14_HSP_XBAR0_INOUT14                                                      0x421C00B8U, 0xAU, 0x421C8320U, 0x1U
#define IOMUXC_PIO3_14_HSP_XBAR1_INOUT14                                                      0x421C00B8U, 0xBU, 0x421C8390U, 0x1U

#define IOMUXC_PIO3_15_HSP_GPIO1_GPIO15                                                       0x421C00BCU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_15_COMM_ENET_QOS_RX_DATA3                                                 0x421C00BCU, 0x1U, 0x421C806CU, 0x0U
#define IOMUXC_PIO3_15_HSP_FLEXIO1_FXIO_D15                                                   0x421C00BCU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_15_AUDIO_SAI1_RX_BCLK                                                     0x421C00BCU, 0x3U, 0x421C8010U, 0x1U
#define IOMUXC_PIO3_15_MEDIA_CSI_DATA15                                                       0x421C00BCU, 0x4U, 0x421C8450U, 0x0U
#define IOMUXC_PIO3_15_MAIN_AHB_SRAMC_SRAMC_ADDR15                                            0x421C00BCU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_15_MEDIA_DCIF_DATA15                                                      0x421C00BCU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_15_MEDIA_DCIF_DBI_AB_DATA15                                               0x421C00BCU, 0x7U, 0x421C849CU, 0x0U
#define IOMUXC_PIO3_15_HSP_LPSPI1_SOUT                                                        0x421C00BCU, 0x8U, 0x421C8210U, 0x1U
#define IOMUXC_PIO3_15_HSP_LPUART3_RTS_B                                                      0x421C00BCU, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_15_HSP_XBAR0_INOUT15                                                      0x421C00BCU, 0xAU, 0x421C8324U, 0x1U
#define IOMUXC_PIO3_15_HSP_XBAR1_INOUT15                                                      0x421C00BCU, 0xBU, 0x421C8394U, 0x1U

#define IOMUXC_PIO3_16_HSP_GPIO1_GPIO16                                                       0x421C00C0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_16_COMM_ENET_QOS_RXEN                                                     0x421C00C0U, 0x1U, 0x421C8070U, 0x0U
#define IOMUXC_PIO3_16_HSP_FLEXIO1_FXIO_D16                                                   0x421C00C0U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_16_AUDIO_SAI1_RX_SYNC                                                     0x421C00C0U, 0x3U, 0x421C801CU, 0x1U
#define IOMUXC_PIO3_16_MEDIA_CSI_MCLK                                                         0x421C00C0U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_16_MAIN_AHB_SRAMC_SRAMC_ADDR16                                            0x421C00C0U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_16_MEDIA_DCIF_DATA16                                                      0x421C00C0U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_16_MEDIA_DCIF_DBI_CSX_AB                                                  0x421C00C0U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_16_HSP_LPSPI1_SIN                                                         0x421C00C0U, 0x8U, 0x421C820CU, 0x1U
#define IOMUXC_PIO3_16_HSP_LPUART3_TXD                                                        0x421C00C0U, 0x9U, 0x421C828CU, 0x1U
#define IOMUXC_PIO3_16_HSP_XBAR0_INOUT16                                                      0x421C00C0U, 0xAU, 0x421C8328U, 0x1U
#define IOMUXC_PIO3_16_HSP_XBAR1_INOUT16                                                      0x421C00C0U, 0xBU, 0x421C8398U, 0x1U

#define IOMUXC_PIO3_17_HSP_GPIO1_GPIO17                                                       0x421C00C4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_17_COMM_ENET_QOS_COL                                                      0x421C00C4U, 0x1U, 0x421C8058U, 0x0U
#define IOMUXC_PIO3_17_HSP_FLEXIO1_FXIO_D17                                                   0x421C00C4U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_17_AUDIO_SAI1_TX_DATA1                                                    0x421C00C4U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_17_MEDIA_CSI_HSYNC                                                        0x421C00C4U, 0x4U, 0x421C8454U, 0x0U
#define IOMUXC_PIO3_17_MAIN_AHB_SRAMC_SRAMC_ADVB                                              0x421C00C4U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_17_MEDIA_DCIF_DATA17                                                      0x421C00C4U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_17_MEDIA_DCIF_DBI_AB_DCS                                                  0x421C00C4U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_17_HSP_LPSPI0_PCS3                                                        0x421C00C4U, 0x8U, 0x421C81E8U, 0x1U
#define IOMUXC_PIO3_17_HSP_LPUART3_RXD                                                        0x421C00C4U, 0x9U, 0x421C8288U, 0x1U
#define IOMUXC_PIO3_17_HSP_XBAR0_INOUT17                                                      0x421C00C4U, 0xAU, 0x421C832CU, 0x1U
#define IOMUXC_PIO3_17_HSP_XBAR1_INOUT17                                                      0x421C00C4U, 0xBU, 0x421C839CU, 0x1U
#define IOMUXC_PIO3_17_AUDIO_MQS_MQS_LEFT                                                     0x421C00C4U, 0xCU, 0x00000000U, 0x0U

#define IOMUXC_PIO3_18_HSP_GPIO1_GPIO18                                                       0x421C00C8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_18_WAKE_EWM_OUT_B                                                         0x421C00C8U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_18_HSP_FLEXIO1_FXIO_D18                                                   0x421C00C8U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_18_AUDIO_SAI1_RX_DATA1                                                    0x421C00C8U, 0x3U, 0x421C8018U, 0x1U
#define IOMUXC_PIO3_18_MEDIA_CSI_VSYNC                                                        0x421C00C8U, 0x4U, 0x421C845CU, 0x0U
#define IOMUXC_PIO3_18_MAIN_AHB_SRAMC_SRAMC_CS0                                               0x421C00C8U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_18_MEDIA_DCIF_DATA18                                                      0x421C00C8U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_18_MEDIA_DCIF_DBI_B_RDX                                                   0x421C00C8U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_18_HSP_LPSPI0_PCS2                                                        0x421C00C8U, 0x8U, 0x421C81E4U, 0x1U
#define IOMUXC_PIO3_18_MEDIA_DCIF_DBI_A_E                                                     0x421C00C8U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_18_HSP_XBAR0_INOUT18                                                      0x421C00C8U, 0xAU, 0x421C8330U, 0x1U
#define IOMUXC_PIO3_18_HSP_XBAR1_INOUT18                                                      0x421C00C8U, 0xBU, 0x421C83A0U, 0x1U
#define IOMUXC_PIO3_18_AUDIO_MQS_MQS_RIGHT                                                    0x421C00C8U, 0xCU, 0x00000000U, 0x0U

#define IOMUXC_PIO3_19_HSP_GPIO1_GPIO19                                                       0x421C00CCU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_19_HSP_FLEXIO1_FXIO_D19                                                   0x421C00CCU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_19_COMM_CCM_CLKREF_25M                                                    0x421C00CCU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_19_MEDIA_CSI_PIXCLK                                                       0x421C00CCU, 0x4U, 0x421C8458U, 0x0U
#define IOMUXC_PIO3_19_MAIN_AHB_SRAMC_SRAMC_CS1                                               0x421C00CCU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_19_MEDIA_DCIF_DATA19                                                      0x421C00CCU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_19_MEDIA_DCIF_DBI_A_RWX_OR_B_WRX                                          0x421C00CCU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_19_HSP_LPSPI0_PCS1                                                        0x421C00CCU, 0x8U, 0x421C81E0U, 0x1U
#define IOMUXC_PIO3_19_AUDIO_MICFIL_PDM_DATA45                                                0x421C00CCU, 0x9U, 0x421C8008U, 0x2U
#define IOMUXC_PIO3_19_HSP_XBAR0_INOUT19                                                      0x421C00CCU, 0xAU, 0x421C8334U, 0x1U
#define IOMUXC_PIO3_19_HSP_XBAR1_INOUT19                                                      0x421C00CCU, 0xBU, 0x421C83A4U, 0x1U

#define IOMUXC_PIO3_20_HSP_GPIO1_GPIO20                                                       0x421C00D0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_20_HSP_FLEXIO1_FXIO_D20                                                   0x421C00D0U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_20_SYSCON_FREQME_CLK_OUT                                                  0x421C00D0U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_20_MEDIA_CSI_FIELD                                                        0x421C00D0U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_20_MAIN_AHB_SRAMC_SRAMC_WP0                                               0x421C00D0U, 0x5U, 0x421C8408U, 0x1U
#define IOMUXC_PIO3_20_MEDIA_DCIF_DATA20                                                      0x421C00D0U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_20_HSP_LPI2C0_SCL                                                         0x421C00D0U, 0x7U, 0x421C81CCU, 0x2U
#define IOMUXC_PIO3_20_HSP_LPSPI0_SCK                                                         0x421C00D0U, 0x8U, 0x421C81ECU, 0x1U
#define IOMUXC_PIO3_20_AUDIO_MICFIL_PDM_DATA23                                                0x421C00D0U, 0x9U, 0x421C8004U, 0x2U
#define IOMUXC_PIO3_20_HSP_XBAR0_INOUT20                                                      0x421C00D0U, 0xAU, 0x421C8338U, 0x1U
#define IOMUXC_PIO3_20_HSP_XBAR1_INOUT20                                                      0x421C00D0U, 0xBU, 0x421C83A8U, 0x1U

#define IOMUXC_PIO3_21_HSP_GPIO1_GPIO21                                                       0x421C00D4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_21_HSP_FLEXIO1_FXIO_D21                                                   0x421C00D4U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_21_MEDIA_FREQME_CLK_OUT                                                   0x421C00D4U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_21_COMM_USB0_ID                                                           0x421C00D4U, 0x4U, 0x421C80ACU, 0x1U
#define IOMUXC_PIO3_21_MAIN_AHB_SRAMC_SRAMC_WP1                                               0x421C00D4U, 0x5U, 0x421C840CU, 0x1U
#define IOMUXC_PIO3_21_MEDIA_DCIF_DATA21                                                      0x421C00D4U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_21_HSP_LPI2C0_SDA                                                         0x421C00D4U, 0x7U, 0x421C81D0U, 0x2U
#define IOMUXC_PIO3_21_HSP_LPSPI0_SOUT                                                        0x421C00D4U, 0x8U, 0x421C81F4U, 0x1U
#define IOMUXC_PIO3_21_AUDIO_MICFIL_PDM_DATA01                                                0x421C00D4U, 0x9U, 0x421C8000U, 0x2U
#define IOMUXC_PIO3_21_HSP_XBAR0_INOUT21                                                      0x421C00D4U, 0xAU, 0x421C833CU, 0x1U
#define IOMUXC_PIO3_21_HSP_XBAR1_INOUT21                                                      0x421C00D4U, 0xBU, 0x421C83ACU, 0x1U
#define IOMUXC_PIO3_21_HSP_eFlexPWM2_PWM_X0                                                   0x421C00D4U, 0xCU, 0x421C8194U, 0x0U

#define IOMUXC_PIO3_22_HSP_GPIO1_GPIO22                                                       0x421C00D8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_22_HSP_FLEXIO1_FXIO_D22                                                   0x421C00D8U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_22_COMM_FREQME_CLK_OUT                                                    0x421C00D8U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_22_COMM_uSDHC1_CD_B                                                       0x421C00D8U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_22_MEDIA_DCIF_DATA22                                                      0x421C00D8U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_22_HSP_FlexCAN2_CAN_TX                                                    0x421C00D8U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_22_HSP_LPSPI0_SIN                                                         0x421C00D8U, 0x8U, 0x421C81F0U, 0x1U
#define IOMUXC_PIO3_22_AUDIO_MICFIL_PDM_CLK                                                   0x421C00D8U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_22_HSP_XBAR0_INOUT22                                                      0x421C00D8U, 0xAU, 0x421C8340U, 0x1U
#define IOMUXC_PIO3_22_HSP_XBAR1_INOUT22                                                      0x421C00D8U, 0xBU, 0x421C83B0U, 0x1U
#define IOMUXC_PIO3_22_HSP_eFlexPWM2_PWM_X1                                                   0x421C00D8U, 0xCU, 0x421C8198U, 0x0U

#define IOMUXC_PIO3_23_HSP_GPIO1_GPIO23                                                       0x421C00DCU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_23_HSP_FLEXIO1_FXIO_D23                                                   0x421C00DCU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_23_MAIN_TRACE_SWO                                                         0x421C00DCU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_23_COMM_USB0_PWR                                                          0x421C00DCU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_23_COMM_uSDHC1_RESET_B                                                    0x421C00DCU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_23_MEDIA_DCIF_DATA23                                                      0x421C00DCU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_23_HSP_FlexCAN2_CAN_RX                                                    0x421C00DCU, 0x7U, 0x421C8114U, 0x0U
#define IOMUXC_PIO3_23_HSP_LPSPI0_PCS0                                                        0x421C00DCU, 0x8U, 0x421C81DCU, 0x1U
#define IOMUXC_PIO3_23_HSP_XBAR0_INOUT23                                                      0x421C00DCU, 0xAU, 0x421C8344U, 0x1U
#define IOMUXC_PIO3_23_HSP_XBAR1_INOUT23                                                      0x421C00DCU, 0xBU, 0x421C83B4U, 0x1U
#define IOMUXC_PIO3_23_HSP_eFlexPWM2_PWM_X2                                                   0x421C00DCU, 0xCU, 0x421C819CU, 0x0U

