zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO3_30_HSP_GPIO1_GPIO30                                                       0x421C00F8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_30_HSP_LPUART0_TXD                                                        0x421C00F8U, 0x1U, 0x421C8268U, 0x2U
#define IOMUXC_PIO3_30_HSP_FLEXIO1_FXIO_D30                                                   0x421C00F8U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_30_AUDIO_FREQME_CLK_OUT                                                   0x421C00F8U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_30_HSP_eFlexPWM1_PWM_X3                                                   0x421C00F8U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_30_COMM_ENET_CRS                                                          0x421C00F8U, 0x5U, 0x421C8080U, 0x0U
#define IOMUXC_PIO3_30_COMM_uSDHC0_WP                                                         0x421C00F8U, 0x6U, 0x421C80B8U, 0x0U
#define IOMUXC_PIO3_30_HSP_XBAR0_INOUT30                                                      0x421C00F8U, 0xAU, 0x00000000U, 0x0U
#define IOMUXC_PIO3_30_HSP_XBAR1_INOUT30                                                      0x421C00F8U, 0xBU, 0x00000000U, 0x0U
#define IOMUXC_PIO3_30_MAIN_XSPI0_TST_TRG                                                     0x421C00F8U, 0xFU, 0x00000000U, 0x0U

#define IOMUXC_PIO3_31_HSP_GPIO1_GPIO31                                                       0x421C00FCU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_31_HSP_LPUART0_RXD                                                        0x421C00FCU, 0x1U, 0x421C8264U, 0x2U
#define IOMUXC_PIO3_31_HSP_FLEXIO1_FXIO_D31                                                   0x421C00FCU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_31_MAIN_FREQME_CLK_OUT                                                    0x421C00FCU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_31_COMM_CCM_CLKREF_25M                                                    0x421C00FCU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_31_COMM_ENET_COL                                                          0x421C00FCU, 0x5U, 0x421C807CU, 0x0U
#define IOMUXC_PIO3_31_COMM_uSDHC0_VSELECT                                                    0x421C00FCU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_31_HSP_XBAR0_INOUT31                                                      0x421C00FCU, 0xAU, 0x00000000U, 0x0U
#define IOMUXC_PIO3_31_HSP_XBAR1_INOUT31                                                      0x421C00FCU, 0xBU, 0x00000000U, 0x0U
#define IOMUXC_PIO3_31_MAIN_XSPI1_TST_TRG                                                     0x421C00FCU, 0xFU, 0x00000000U, 0x0U

#define IOMUXC_PIO4_0_HSP_GPIO2_GPIO0                                                         0x421C0100U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_0_COMM_ENET_TX_CLK_IO                                                     0x421C0100U, 0x1U, 0x421C80A4U, 0x0U
#define IOMUXC_PIO4_0_HSP_FLEXIO2_FXIO_D00                                                    0x421C0100U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_0_AUDIO_SAI2_MCLK                                                         0x421C0100U, 0x3U, 0x421C8028U, 0x0U
#define IOMUXC_PIO4_0_MEDIA_CSI_DATA23                                                        0x421C0100U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_0_HSP_SINC1_MBIT0                                                         0x421C0100U, 0x5U, 0x421C82C8U, 0x0U
#define IOMUXC_PIO4_0_MEDIA_DCIF_DATA00                                                       0x421C0100U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_0_MEDIA_DCIF_DBI_AB_DATA00                                                0x421C0100U, 0x7U, 0x421C8460U, 0x1U
#define IOMUXC_PIO4_0_HSP_eFlexPWM2_PWM_A0                                                    0x421C0100U, 0x8U, 0x421C8174U, 0x1U
#define IOMUXC_PIO4_0_COMM_ENET_REF_CLK                                                       0x421C0100U, 0x9U, 0x421C8078U, 0x0U
#define IOMUXC_PIO4_0_HSP_XBAR0_INOUT00                                                       0x421C0100U, 0xAU, 0x421C82E8U, 0x2U
#define IOMUXC_PIO4_0_HSP_XBAR1_INOUT00                                                       0x421C0100U, 0xBU, 0x421C8358U, 0x2U
#define IOMUXC_PIO4_0_COMM_TENBASET_PHY1_TX                                                   0x421C0100U, 0xCU, 0x00000000U, 0x0U

#define IOMUXC_PIO4_1_HSP_GPIO2_GPIO1                                                         0x421C0104U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_1_COMM_ENET_TXD0                                                          0x421C0104U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_1_HSP_FLEXIO2_FXIO_D01                                                    0x421C0104U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_1_AUDIO_SAI2_TX_BCLK                                                      0x421C0104U, 0x3U, 0x421C803CU, 0x0U
#define IOMUXC_PIO4_1_MEDIA_CSI_DATA22                                                        0x421C0104U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_1_HSP_SINC1_MCLK0                                                         0x421C0104U, 0x5U, 0x421C82D8U, 0x0U
#define IOMUXC_PIO4_1_MEDIA_DCIF_DATA01                                                       0x421C0104U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_1_MEDIA_DCIF_DBI_AB_DATA01                                                0x421C0104U, 0x7U, 0x421C8464U, 0x1U
#define IOMUXC_PIO4_1_HSP_eFlexPWM2_PWM_B0                                                    0x421C0104U, 0x8U, 0x421C8184U, 0x1U
#define IOMUXC_PIO4_1_HSP_SINC1_MCLK_OUT0                                                     0x421C0104U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_1_HSP_XBAR0_INOUT01                                                       0x421C0104U, 0xAU, 0x421C82ECU, 0x2U
#define IOMUXC_PIO4_1_HSP_XBAR1_INOUT01                                                       0x421C0104U, 0xBU, 0x421C835CU, 0x2U
#define IOMUXC_PIO4_1_COMM_TENBASET_PHY1_ED                                                   0x421C0104U, 0xCU, 0x421C80DCU, 0x0U

