zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO4_2_HSP_GPIO2_GPIO2                                                         0x421C0108U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_2_COMM_ENET_TXD1                                                          0x421C0108U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_2_HSP_FLEXIO2_FXIO_D02                                                    0x421C0108U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_2_AUDIO_SAI2_TX_SYNC                                                      0x421C0108U, 0x3U, 0x421C8040U, 0x0U
#define IOMUXC_PIO4_2_MEDIA_CSI_DATA21                                                        0x421C0108U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_2_HSP_SINC1_MCLK1                                                         0x421C0108U, 0x5U, 0x421C82DCU, 0x0U
#define IOMUXC_PIO4_2_MEDIA_DCIF_DATA02                                                       0x421C0108U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_2_MEDIA_DCIF_DBI_AB_DATA02                                                0x421C0108U, 0x7U, 0x421C8468U, 0x1U
#define IOMUXC_PIO4_2_HSP_eFlexPWM2_PWM_A1                                                    0x421C0108U, 0x8U, 0x421C8178U, 0x1U
#define IOMUXC_PIO4_2_HSP_SINC1_MCLK_OUT1                                                     0x421C0108U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_2_HSP_XBAR0_INOUT02                                                       0x421C0108U, 0xAU, 0x421C82F0U, 0x2U
#define IOMUXC_PIO4_2_HSP_XBAR1_INOUT02                                                       0x421C0108U, 0xBU, 0x421C8360U, 0x2U
#define IOMUXC_PIO4_2_COMM_TENBASET_PHY1_RX                                                   0x421C0108U, 0xCU, 0x421C80E0U, 0x0U

#define IOMUXC_PIO4_3_HSP_GPIO2_GPIO3                                                         0x421C010CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_3_COMM_ENET_TX_EN                                                         0x421C010CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_3_HSP_FLEXIO2_FXIO_D03                                                    0x421C010CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_3_AUDIO_SAI2_RX_DATA0                                                     0x421C010CU, 0x3U, 0x421C8030U, 0x0U
#define IOMUXC_PIO4_3_MEDIA_CSI_DATA20                                                        0x421C010CU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_3_HSP_SINC1_MBIT1                                                         0x421C010CU, 0x5U, 0x421C82CCU, 0x0U
#define IOMUXC_PIO4_3_MEDIA_DCIF_DATA03                                                       0x421C010CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_3_MEDIA_DCIF_DBI_AB_DATA03                                                0x421C010CU, 0x7U, 0x421C846CU, 0x1U
#define IOMUXC_PIO4_3_HSP_eFlexPWM2_PWM_B1                                                    0x421C010CU, 0x8U, 0x421C8188U, 0x1U
#define IOMUXC_PIO4_3_HSP_XBAR0_INOUT03                                                       0x421C010CU, 0xAU, 0x421C82F4U, 0x2U
#define IOMUXC_PIO4_3_HSP_XBAR1_INOUT03                                                       0x421C010CU, 0xBU, 0x421C8364U, 0x2U
#define IOMUXC_PIO4_3_COMM_TENBASET_PHY1_TX                                                   0x421C010CU, 0xCU, 0x00000000U, 0x0U

#define IOMUXC_PIO4_4_HSP_GPIO2_GPIO4                                                         0x421C0110U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_4_COMM_ENET_RXD0                                                          0x421C0110U, 0x1U, 0x421C808CU, 0x0U
#define IOMUXC_PIO4_4_HSP_FLEXIO2_FXIO_D04                                                    0x421C0110U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_4_AUDIO_SAI2_TX_DATA0                                                     0x421C0110U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_4_MEDIA_CSI_DATA19                                                        0x421C0110U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_4_HSP_SINC1_MCLK2                                                         0x421C0110U, 0x5U, 0x421C82E0U, 0x0U
#define IOMUXC_PIO4_4_MEDIA_DCIF_DATA04                                                       0x421C0110U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_4_MEDIA_DCIF_DBI_AB_DATA04                                                0x421C0110U, 0x7U, 0x421C8470U, 0x1U
#define IOMUXC_PIO4_4_HSP_eFlexPWM2_PWM_A2                                                    0x421C0110U, 0x8U, 0x421C817CU, 0x0U
#define IOMUXC_PIO4_4_HSP_SINC1_MCLK_OUT2                                                     0x421C0110U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_4_HSP_XBAR0_INOUT04                                                       0x421C0110U, 0xAU, 0x421C82F8U, 0x2U
#define IOMUXC_PIO4_4_HSP_XBAR1_INOUT04                                                       0x421C0110U, 0xBU, 0x421C8368U, 0x2U
#define IOMUXC_PIO4_4_COMM_TENBASET_PHY1_ED                                                   0x421C0110U, 0xCU, 0x421C80DCU, 0x1U

#define IOMUXC_PIO4_5_HSP_GPIO2_GPIO5                                                         0x421C0114U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_5_COMM_ENET_RXD1                                                          0x421C0114U, 0x1U, 0x421C8090U, 0x0U
#define IOMUXC_PIO4_5_HSP_FLEXIO2_FXIO_D05                                                    0x421C0114U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_5_AUDIO_SAI2_RX_BCLK                                                      0x421C0114U, 0x3U, 0x421C802CU, 0x0U
#define IOMUXC_PIO4_5_MEDIA_CSI_DATA18                                                        0x421C0114U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_5_HSP_SINC1_MBIT2                                                         0x421C0114U, 0x5U, 0x421C82D0U, 0x0U
#define IOMUXC_PIO4_5_MEDIA_DCIF_DATA05                                                       0x421C0114U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_5_MEDIA_DCIF_DBI_AB_DATA05                                                0x421C0114U, 0x7U, 0x421C8474U, 0x1U
#define IOMUXC_PIO4_5_HSP_eFlexPWM2_PWM_B2                                                    0x421C0114U, 0x8U, 0x421C818CU, 0x0U
#define IOMUXC_PIO4_5_HSP_XBAR0_INOUT05                                                       0x421C0114U, 0xAU, 0x421C82FCU, 0x2U
#define IOMUXC_PIO4_5_HSP_XBAR1_INOUT05                                                       0x421C0114U, 0xBU, 0x421C836CU, 0x2U
#define IOMUXC_PIO4_5_COMM_TENBASET_PHY1_RX                                                   0x421C0114U, 0xCU, 0x421C80E0U, 0x1U

#define IOMUXC_PIO4_6_HSP_GPIO2_GPIO6                                                         0x421C0118U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_6_COMM_ENET_MDIO                                                          0x421C0118U, 0x1U, 0x421C8084U, 0x0U
#define IOMUXC_PIO4_6_HSP_FLEXIO2_FXIO_D06                                                    0x421C0118U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_6_AUDIO_SAI2_RX_SYNC                                                      0x421C0118U, 0x3U, 0x421C8038U, 0x0U
#define IOMUXC_PIO4_6_MEDIA_CSI_DATA17                                                        0x421C0118U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_6_HSP_SINC1_MCLK3                                                         0x421C0118U, 0x5U, 0x421C82E4U, 0x0U
#define IOMUXC_PIO4_6_MEDIA_DCIF_DATA06                                                       0x421C0118U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_6_MEDIA_DCIF_DBI_AB_DATA06                                                0x421C0118U, 0x7U, 0x421C8478U, 0x1U
#define IOMUXC_PIO4_6_HSP_eFlexPWM2_PWM_A3                                                    0x421C0118U, 0x8U, 0x421C8180U, 0x1U
#define IOMUXC_PIO4_6_HSP_LPUART4_RTS_B                                                       0x421C0118U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_6_HSP_XBAR0_INOUT06                                                       0x421C0118U, 0xAU, 0x421C8300U, 0x2U
#define IOMUXC_PIO4_6_HSP_XBAR1_INOUT06                                                       0x421C0118U, 0xBU, 0x421C8370U, 0x2U

