zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO4_7_HSP_GPIO2_GPIO7                                                         0x421C011CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_7_COMM_ENET_MDC                                                           0x421C011CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_7_HSP_FLEXIO2_FXIO_D07                                                    0x421C011CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_7_AUDIO_SAI2_TX_DATA1                                                     0x421C011CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_7_MEDIA_CSI_DATA16                                                        0x421C011CU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_7_HSP_SINC1_MBIT3                                                         0x421C011CU, 0x5U, 0x421C82D4U, 0x0U
#define IOMUXC_PIO4_7_MEDIA_DCIF_DATA07                                                       0x421C011CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_7_MEDIA_DCIF_DBI_AB_DATA07                                                0x421C011CU, 0x7U, 0x421C847CU, 0x1U
#define IOMUXC_PIO4_7_HSP_eFlexPWM2_PWM_B3                                                    0x421C011CU, 0x8U, 0x421C8190U, 0x1U
#define IOMUXC_PIO4_7_HSP_LPUART4_CTS_B                                                       0x421C011CU, 0x9U, 0x421C8290U, 0x1U
#define IOMUXC_PIO4_7_HSP_XBAR0_INOUT07                                                       0x421C011CU, 0xAU, 0x421C8304U, 0x2U
#define IOMUXC_PIO4_7_HSP_XBAR1_INOUT07                                                       0x421C011CU, 0xBU, 0x421C8374U, 0x2U

#define IOMUXC_PIO4_8_HSP_GPIO2_GPIO8                                                         0x421C0120U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_8_COMM_ENET_TXD2                                                          0x421C0120U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_8_HSP_FLEXIO2_FXIO_D08                                                    0x421C0120U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_8_AUDIO_SAI2_RX_DATA1                                                     0x421C0120U, 0x3U, 0x421C8034U, 0x0U
#define IOMUXC_PIO4_8_MEDIA_CSI_DATA15                                                        0x421C0120U, 0x4U, 0x421C8450U, 0x1U
#define IOMUXC_PIO4_8_HSP_SINC1_BREAK                                                         0x421C0120U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_8_MEDIA_DCIF_DATA08                                                       0x421C0120U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_8_MEDIA_DCIF_DBI_AB_DATA08                                                0x421C0120U, 0x7U, 0x421C8480U, 0x1U
#define IOMUXC_PIO4_8_COMM_TENBASET_PHY1_TX                                                   0x421C0120U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_8_HSP_LPUART4_TXD                                                         0x421C0120U, 0x9U, 0x421C8298U, 0x1U
#define IOMUXC_PIO4_8_HSP_XBAR0_INOUT08                                                       0x421C0120U, 0xAU, 0x421C8308U, 0x2U
#define IOMUXC_PIO4_8_HSP_XBAR1_INOUT08                                                       0x421C0120U, 0xBU, 0x421C8378U, 0x2U
#define IOMUXC_PIO4_8_COMM_ENET_QOS_COL                                                       0x421C0120U, 0xCU, 0x421C8058U, 0x1U

#define IOMUXC_PIO4_9_HSP_GPIO2_GPIO9                                                         0x421C0124U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_9_COMM_ENET_TXD3                                                          0x421C0124U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_9_HSP_FLEXIO2_FXIO_D09                                                    0x421C0124U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_9_AUDIO_FREQME_CLK_OUT                                                    0x421C0124U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_9_MEDIA_CSI_DATA14                                                        0x421C0124U, 0x4U, 0x421C844CU, 0x1U
#define IOMUXC_PIO4_9_MEDIA_DCIF_DATA09                                                       0x421C0124U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_9_MEDIA_DCIF_DBI_AB_DATA09                                                0x421C0124U, 0x7U, 0x421C8484U, 0x1U
#define IOMUXC_PIO4_9_HSP_eFlexPWM3_PWM_A0                                                    0x421C0124U, 0x8U, 0x421C81A4U, 0x0U
#define IOMUXC_PIO4_9_HSP_LPUART4_RXD                                                         0x421C0124U, 0x9U, 0x421C8294U, 0x1U
#define IOMUXC_PIO4_9_HSP_XBAR0_INOUT09                                                       0x421C0124U, 0xAU, 0x421C830CU, 0x2U
#define IOMUXC_PIO4_9_HSP_XBAR1_INOUT09                                                       0x421C0124U, 0xBU, 0x421C837CU, 0x2U
#define IOMUXC_PIO4_9_COMM_ENET_QOS_CRS                                                       0x421C0124U, 0xCU, 0x421C805CU, 0x1U

#define IOMUXC_PIO4_10_HSP_GPIO2_GPIO10                                                       0x421C0128U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_10_COMM_ENET_RX_CLK                                                       0x421C0128U, 0x1U, 0x421C8088U, 0x0U
#define IOMUXC_PIO4_10_HSP_FLEXIO2_FXIO_D10                                                   0x421C0128U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_10_AUDIO_MICFIL_PDM_CLK                                                   0x421C0128U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_10_MEDIA_CSI_DATA13                                                       0x421C0128U, 0x4U, 0x421C8448U, 0x1U
#define IOMUXC_PIO4_10_MEDIA_DCIF_DATA10                                                      0x421C0128U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_10_MEDIA_DCIF_DBI_AB_DATA10                                               0x421C0128U, 0x7U, 0x421C8488U, 0x1U
#define IOMUXC_PIO4_10_HSP_eFlexPWM3_PWM_B0                                                   0x421C0128U, 0x8U, 0x421C81B4U, 0x0U
#define IOMUXC_PIO4_10_HSP_LPUART5_TXD                                                        0x421C0128U, 0x9U, 0x421C82A4U, 0x1U
#define IOMUXC_PIO4_10_HSP_XBAR1_INOUT10                                                      0x421C0128U, 0xBU, 0x421C8380U, 0x2U

#define IOMUXC_PIO4_11_HSP_GPIO2_GPIO11                                                       0x421C012CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_11_COMM_ENET_RXD2                                                         0x421C012CU, 0x1U, 0x421C8094U, 0x0U
#define IOMUXC_PIO4_11_HSP_FLEXIO2_FXIO_D11                                                   0x421C012CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_11_AUDIO_MICFIL_PDM_DATA45                                                0x421C012CU, 0x3U, 0x421C8008U, 0x3U
#define IOMUXC_PIO4_11_MEDIA_CSI_DATA12                                                       0x421C012CU, 0x4U, 0x421C8444U, 0x1U
#define IOMUXC_PIO4_11_MEDIA_DCIF_DATA11                                                      0x421C012CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_11_MEDIA_DCIF_DBI_AB_DATA11                                               0x421C012CU, 0x7U, 0x421C848CU, 0x1U
#define IOMUXC_PIO4_11_HSP_eFlexPWM3_PWM_A1                                                   0x421C012CU, 0x8U, 0x421C81A8U, 0x0U
#define IOMUXC_PIO4_11_HSP_LPUART5_RXD                                                        0x421C012CU, 0x9U, 0x421C82A0U, 0x1U
#define IOMUXC_PIO4_11_HSP_XBAR1_INOUT11                                                      0x421C012CU, 0xBU, 0x421C8384U, 0x2U
#define IOMUXC_PIO4_11_COMM_ENET_QOS_TX_ER                                                    0x421C012CU, 0xCU, 0x00000000U, 0x0U

#define IOMUXC_PIO4_12_HSP_GPIO2_GPIO12                                                       0x421C0130U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_12_COMM_ENET_RXD3                                                         0x421C0130U, 0x1U, 0x421C8098U, 0x0U
#define IOMUXC_PIO4_12_HSP_FLEXIO2_FXIO_D12                                                   0x421C0130U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_12_AUDIO_MICFIL_PDM_DATA23                                                0x421C0130U, 0x3U, 0x421C8004U, 0x3U
#define IOMUXC_PIO4_12_MEDIA_CSI_DATA11                                                       0x421C0130U, 0x4U, 0x421C8440U, 0x1U
#define IOMUXC_PIO4_12_HSP_LPSPI2_PCS2                                                        0x421C0130U, 0x5U, 0x421C821CU, 0x0U
#define IOMUXC_PIO4_12_MEDIA_DCIF_DATA12                                                      0x421C0130U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_12_MEDIA_DCIF_DBI_AB_DATA12                                               0x421C0130U, 0x7U, 0x421C8490U, 0x1U
#define IOMUXC_PIO4_12_HSP_eFlexPWM3_PWM_B1                                                   0x421C0130U, 0x8U, 0x421C81B8U, 0x0U
#define IOMUXC_PIO4_12_HSP_LPUART5_CTS_B                                                      0x421C0130U, 0x9U, 0x421C829CU, 0x1U
#define IOMUXC_PIO4_12_HSP_XBAR1_INOUT12                                                      0x421C0130U, 0xBU, 0x421C8388U, 0x2U
#define IOMUXC_PIO4_12_COMM_ENET_QOS_RXER                                                     0x421C0130U, 0xCU, 0x421C8074U, 0x1U

#define IOMUXC_PIO4_13_HSP_GPIO2_GPIO13                                                       0x421C0134U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_13_COMM_ENET_RX_EN                                                        0x421C0134U, 0x1U, 0x421C809CU, 0x0U
#define IOMUXC_PIO4_13_HSP_FLEXIO2_FXIO_D13                                                   0x421C0134U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_13_AUDIO_MICFIL_PDM_DATA01                                                0x421C0134U, 0x3U, 0x421C8000U, 0x3U
#define IOMUXC_PIO4_13_MEDIA_CSI_DATA10                                                       0x421C0134U, 0x4U, 0x421C843CU, 0x1U
#define IOMUXC_PIO4_13_HSP_LPSPI2_PCS3                                                        0x421C0134U, 0x5U, 0x421C8220U, 0x0U
#define IOMUXC_PIO4_13_MEDIA_DCIF_DATA13                                                      0x421C0134U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_13_MEDIA_DCIF_DBI_AB_DATA13                                               0x421C0134U, 0x7U, 0x421C8494U, 0x1U
#define IOMUXC_PIO4_13_HSP_eFlexPWM3_PWM_A2                                                   0x421C0134U, 0x8U, 0x421C81ACU, 0x0U
#define IOMUXC_PIO4_13_HSP_LPUART5_RTS_B                                                      0x421C0134U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_13_HSP_XBAR1_INOUT13                                                      0x421C0134U, 0xBU, 0x421C838CU, 0x2U

#define IOMUXC_PIO4_14_HSP_GPIO2_GPIO14                                                       0x421C0138U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_14_COMM_ENET_QOS_TX_CLK_IO                                                0x421C0138U, 0x1U, 0x421C8050U, 0x1U
#define IOMUXC_PIO4_14_HSP_FLEXIO2_FXIO_D14                                                   0x421C0138U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_14_COMM_ENET_QOS_REF_CLK                                                  0x421C0138U, 0x3U, 0x421C8048U, 0x1U
#define IOMUXC_PIO4_14_MEDIA_CSI_DATA09                                                       0x421C0138U, 0x4U, 0x421C8438U, 0x1U
#define IOMUXC_PIO4_14_HSP_LPSPI2_PCS0                                                        0x421C0138U, 0x5U, 0x421C8214U, 0x0U
#define IOMUXC_PIO4_14_MEDIA_DCIF_DATA14                                                      0x421C0138U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_14_MEDIA_DCIF_DBI_AB_DATA14                                               0x421C0138U, 0x7U, 0x421C8498U, 0x1U
#define IOMUXC_PIO4_14_HSP_eFlexPWM3_PWM_B2                                                   0x421C0138U, 0x8U, 0x421C81BCU, 0x0U
#define IOMUXC_PIO4_14_HSP_XBAR1_INOUT14                                                      0x421C0138U, 0xBU, 0x421C8390U, 0x2U

#define IOMUXC_PIO4_15_HSP_GPIO2_GPIO15                                                       0x421C013CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_15_COMM_ENET_QOS_TX_DATA0                                                 0x421C013CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_15_HSP_FLEXIO2_FXIO_D15                                                   0x421C013CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_15_MEDIA_CSI_DATA08                                                       0x421C013CU, 0x4U, 0x421C8434U, 0x1U
#define IOMUXC_PIO4_15_HSP_LPSPI2_SCK                                                         0x421C013CU, 0x5U, 0x421C8224U, 0x0U
#define IOMUXC_PIO4_15_MEDIA_DCIF_DATA15                                                      0x421C013CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_15_MEDIA_DCIF_DBI_AB_DATA15                                               0x421C013CU, 0x7U, 0x421C849CU, 0x1U
#define IOMUXC_PIO4_15_HSP_eFlexPWM3_PWM_A3                                                   0x421C013CU, 0x8U, 0x421C81B0U, 0x0U
#define IOMUXC_PIO4_15_HSP_XBAR1_INOUT15                                                      0x421C013CU, 0xBU, 0x421C8394U, 0x2U

