zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO4_16_HSP_GPIO2_GPIO16                                                       0x421C0140U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_16_COMM_ENET_QOS_TX_DATA1                                                 0x421C0140U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_16_HSP_FLEXIO2_FXIO_D16                                                   0x421C0140U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_16_MEDIA_CSI_DATA07                                                       0x421C0140U, 0x4U, 0x421C8430U, 0x1U
#define IOMUXC_PIO4_16_HSP_LPSPI2_SOUT                                                        0x421C0140U, 0x5U, 0x421C822CU, 0x0U
#define IOMUXC_PIO4_16_MEDIA_DCIF_DATA16                                                      0x421C0140U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_16_MEDIA_DCIF_DBI_CSX_AB                                                  0x421C0140U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_16_HSP_eFlexPWM3_PWM_B3                                                   0x421C0140U, 0x8U, 0x421C81C0U, 0x0U
#define IOMUXC_PIO4_16_HSP_XBAR1_INOUT16                                                      0x421C0140U, 0xBU, 0x421C8398U, 0x2U

#define IOMUXC_PIO4_17_HSP_GPIO2_GPIO17                                                       0x421C0144U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_17_COMM_ENET_QOS_TX_EN                                                    0x421C0144U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_17_HSP_FLEXIO2_FXIO_D17                                                   0x421C0144U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_17_AUDIO_SAI2_RX_DATA1                                                    0x421C0144U, 0x3U, 0x421C8034U, 0x1U
#define IOMUXC_PIO4_17_MEDIA_CSI_DATA06                                                       0x421C0144U, 0x4U, 0x421C842CU, 0x1U
#define IOMUXC_PIO4_17_HSP_LPSPI2_SIN                                                         0x421C0144U, 0x5U, 0x421C8228U, 0x0U
#define IOMUXC_PIO4_17_MEDIA_DCIF_DATA17                                                      0x421C0144U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_17_MEDIA_DCIF_DBI_AB_DCS                                                  0x421C0144U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_17_HSP_eFlexPWM3_PWM_X0                                                   0x421C0144U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_17_HSP_FlexCAN2_CAN_TX                                                    0x421C0144U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_17_HSP_XBAR1_INOUT17                                                      0x421C0144U, 0xBU, 0x421C839CU, 0x2U

#define IOMUXC_PIO4_18_HSP_GPIO2_GPIO18                                                       0x421C0148U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_18_COMM_ENET_QOS_RX_DATA0                                                 0x421C0148U, 0x1U, 0x421C8060U, 0x1U
#define IOMUXC_PIO4_18_HSP_FLEXIO2_FXIO_D18                                                   0x421C0148U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_18_AUDIO_SAI2_TX_DATA1                                                    0x421C0148U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_18_MEDIA_CSI_DATA05                                                       0x421C0148U, 0x4U, 0x421C8428U, 0x1U
#define IOMUXC_PIO4_18_HSP_LPSPI2_PCS1                                                        0x421C0148U, 0x5U, 0x421C8218U, 0x0U
#define IOMUXC_PIO4_18_MEDIA_DCIF_DATA18                                                      0x421C0148U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_18_MEDIA_DCIF_DBI_A_RWX_OR_B_WRX                                          0x421C0148U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_18_HSP_eFlexPWM3_PWM_X1                                                   0x421C0148U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_18_HSP_FlexCAN2_CAN_RX                                                    0x421C0148U, 0x9U, 0x421C8114U, 0x1U
#define IOMUXC_PIO4_18_WAKE_EWM_OUT_B                                                         0x421C0148U, 0xAU, 0x00000000U, 0x0U
#define IOMUXC_PIO4_18_HSP_XBAR1_INOUT18                                                      0x421C0148U, 0xBU, 0x421C83A0U, 0x2U

#define IOMUXC_PIO4_19_HSP_GPIO2_GPIO19                                                       0x421C014CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_19_COMM_ENET_QOS_RX_DATA1                                                 0x421C014CU, 0x1U, 0x421C8064U, 0x1U
#define IOMUXC_PIO4_19_HSP_FLEXIO2_FXIO_D19                                                   0x421C014CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_19_AUDIO_SAI2_MCLK                                                        0x421C014CU, 0x3U, 0x421C8028U, 0x1U
#define IOMUXC_PIO4_19_MEDIA_CSI_DATA04                                                       0x421C014CU, 0x4U, 0x421C8424U, 0x1U
#define IOMUXC_PIO4_19_MEDIA_DCIF_DATA19                                                      0x421C014CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_19_MEDIA_DCIF_DBI_B_RDX                                                   0x421C014CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_19_HSP_eFlexPWM3_PWM_X2                                                   0x421C014CU, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_19_MEDIA_DCIF_DBI_A_E                                                     0x421C014CU, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_19_HSP_SINC1_MBIT0                                                        0x421C014CU, 0xAU, 0x421C82C8U, 0x1U
#define IOMUXC_PIO4_19_HSP_XBAR1_INOUT19                                                      0x421C014CU, 0xBU, 0x421C83A4U, 0x2U

#define IOMUXC_PIO4_20_HSP_GPIO2_GPIO20                                                       0x421C0150U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_20_COMM_ENET_QOS_MDIO                                                     0x421C0150U, 0x1U, 0x421C8054U, 0x1U
#define IOMUXC_PIO4_20_HSP_FLEXIO2_FXIO_D20                                                   0x421C0150U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_20_AUDIO_SAI2_RX_DATA0                                                    0x421C0150U, 0x3U, 0x421C8030U, 0x1U
#define IOMUXC_PIO4_20_MEDIA_CSI_DATA03                                                       0x421C0150U, 0x4U, 0x421C8420U, 0x1U
#define IOMUXC_PIO4_20_COMM_USB1_VBUS_GPIO                                                    0x421C0150U, 0x5U, 0x421C80B0U, 0x1U
#define IOMUXC_PIO4_20_MEDIA_DCIF_DATA20                                                      0x421C0150U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_20_HSP_eFlexPWM3_PWM_X3                                                   0x421C0150U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_20_HSP_LPUART4_RTS_B                                                      0x421C0150U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_20_HSP_SINC1_MBIT1                                                        0x421C0150U, 0xAU, 0x421C82CCU, 0x1U
#define IOMUXC_PIO4_20_HSP_XBAR1_INOUT20                                                      0x421C0150U, 0xBU, 0x421C83A8U, 0x2U

#define IOMUXC_PIO4_21_HSP_GPIO2_GPIO21                                                       0x421C0154U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_21_COMM_ENET_QOS_MDC                                                      0x421C0154U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_21_HSP_FLEXIO2_FXIO_D21                                                   0x421C0154U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_21_AUDIO_SAI2_TX_DATA0                                                    0x421C0154U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_21_MEDIA_CSI_DATA02                                                       0x421C0154U, 0x4U, 0x421C841CU, 0x1U
#define IOMUXC_PIO4_21_AUDIO_SPDIF_IN                                                         0x421C0154U, 0x5U, 0x421C8044U, 0x1U
#define IOMUXC_PIO4_21_MEDIA_DCIF_DATA21                                                      0x421C0154U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_21_COMM_TENBASET_PHY0_TX                                                  0x421C0154U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_21_HSP_eFlexPWM2_PWM_X0                                                   0x421C0154U, 0x8U, 0x421C8194U, 0x1U
#define IOMUXC_PIO4_21_HSP_LPUART4_CTS_B                                                      0x421C0154U, 0x9U, 0x421C8290U, 0x2U
#define IOMUXC_PIO4_21_HSP_SINC1_MBIT2                                                        0x421C0154U, 0xAU, 0x421C82D0U, 0x1U
#define IOMUXC_PIO4_21_HSP_XBAR1_INOUT21                                                      0x421C0154U, 0xBU, 0x421C83ACU, 0x2U

#define IOMUXC_PIO4_22_HSP_GPIO2_GPIO22                                                       0x421C0158U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_22_COMM_ENET_QOS_TX_DATA2                                                 0x421C0158U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_22_HSP_FLEXIO2_FXIO_D22                                                   0x421C0158U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_22_AUDIO_SAI2_TX_BCLK                                                     0x421C0158U, 0x3U, 0x421C803CU, 0x1U
#define IOMUXC_PIO4_22_MEDIA_CSI_DATA01                                                       0x421C0158U, 0x4U, 0x421C8418U, 0x1U
#define IOMUXC_PIO4_22_AUDIO_SPDIF_OUT                                                        0x421C0158U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_22_MEDIA_DCIF_DATA22                                                      0x421C0158U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_22_COMM_TENBASET_PHY0_ED                                                  0x421C0158U, 0x7U, 0x421C80D4U, 0x1U
#define IOMUXC_PIO4_22_HSP_eFlexPWM2_PWM_X1                                                   0x421C0158U, 0x8U, 0x421C8198U, 0x1U
#define IOMUXC_PIO4_22_HSP_LPUART4_RXD                                                        0x421C0158U, 0x9U, 0x421C8294U, 0x2U
#define IOMUXC_PIO4_22_HSP_SINC1_MBIT3                                                        0x421C0158U, 0xAU, 0x421C82D4U, 0x1U
#define IOMUXC_PIO4_22_HSP_XBAR1_INOUT22                                                      0x421C0158U, 0xBU, 0x421C83B0U, 0x2U
#define IOMUXC_PIO4_22_COMM_ENET_RX_ER                                                        0x421C0158U, 0xCU, 0x421C80A0U, 0x1U

#define IOMUXC_PIO4_23_HSP_GPIO2_GPIO23                                                       0x421C015CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_23_COMM_ENET_QOS_TX_DATA3                                                 0x421C015CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_23_HSP_FLEXIO2_FXIO_D23                                                   0x421C015CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_23_AUDIO_SAI2_TX_SYNC                                                     0x421C015CU, 0x3U, 0x421C8040U, 0x1U
#define IOMUXC_PIO4_23_MEDIA_CSI_DATA00                                                       0x421C015CU, 0x4U, 0x421C8414U, 0x1U
#define IOMUXC_PIO4_23_HSP_SINC1_MCLK_OUT0                                                    0x421C015CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_23_MEDIA_DCIF_DATA23                                                      0x421C015CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_23_COMM_TENBASET_PHY0_RX                                                  0x421C015CU, 0x7U, 0x421C80D8U, 0x1U
#define IOMUXC_PIO4_23_HSP_eFlexPWM2_PWM_X2                                                   0x421C015CU, 0x8U, 0x421C819CU, 0x1U
#define IOMUXC_PIO4_23_HSP_LPUART4_TXD                                                        0x421C015CU, 0x9U, 0x421C8298U, 0x2U
#define IOMUXC_PIO4_23_HSP_SINC1_MCLK0                                                        0x421C015CU, 0xAU, 0x421C82D8U, 0x1U
#define IOMUXC_PIO4_23_HSP_XBAR1_INOUT23                                                      0x421C015CU, 0xBU, 0x421C83B4U, 0x2U
#define IOMUXC_PIO4_23_COMM_ENET_TX_ER                                                        0x421C015CU, 0xCU, 0x00000000U, 0x0U

#define IOMUXC_PIO4_24_HSP_GPIO2_GPIO24                                                       0x421C0160U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_24_COMM_ENET_QOS_RX_CLK                                                   0x421C0160U, 0x1U, 0x421C804CU, 0x1U
#define IOMUXC_PIO4_24_HSP_FLEXIO2_FXIO_D24                                                   0x421C0160U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_24_AUDIO_SAI2_RX_SYNC                                                     0x421C0160U, 0x3U, 0x421C8038U, 0x1U
#define IOMUXC_PIO4_24_MEDIA_CSI_MCLK                                                         0x421C0160U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_24_HSP_SINC1_MCLK_OUT1                                                    0x421C0160U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_24_MEDIA_DCIF_PIXEL_CLK                                                   0x421C0160U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_24_HSP_eFlexPWM2_PWM_X3                                                   0x421C0160U, 0x8U, 0x421C81A0U, 0x1U
#define IOMUXC_PIO4_24_HSP_LPUART5_CTS_B                                                      0x421C0160U, 0x9U, 0x421C829CU, 0x2U
#define IOMUXC_PIO4_24_HSP_SINC1_MCLK1                                                        0x421C0160U, 0xAU, 0x421C82DCU, 0x1U
#define IOMUXC_PIO4_24_HSP_XBAR1_INOUT24                                                      0x421C0160U, 0xBU, 0x421C83B8U, 0x2U

#define IOMUXC_PIO4_25_HSP_GPIO2_GPIO25                                                       0x421C0164U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_25_COMM_ENET_QOS_RX_DATA2                                                 0x421C0164U, 0x1U, 0x421C8068U, 0x1U
#define IOMUXC_PIO4_25_HSP_FLEXIO2_FXIO_D25                                                   0x421C0164U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_25_AUDIO_SAI2_RX_BCLK                                                     0x421C0164U, 0x3U, 0x421C802CU, 0x1U
#define IOMUXC_PIO4_25_MEDIA_CSI_HSYNC                                                        0x421C0164U, 0x4U, 0x421C8454U, 0x1U
#define IOMUXC_PIO4_25_HSP_SINC1_MCLK_OUT2                                                    0x421C0164U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_25_MEDIA_DCIF_HSYNC                                                       0x421C0164U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_25_COMM_TENBASET_PHY0_TX                                                  0x421C0164U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_25_HSP_LPUART5_RTS_B                                                      0x421C0164U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_25_HSP_SINC1_MCLK2                                                        0x421C0164U, 0xAU, 0x421C82E0U, 0x1U
#define IOMUXC_PIO4_25_HSP_XBAR1_INOUT25                                                      0x421C0164U, 0xBU, 0x421C83BCU, 0x2U
#define IOMUXC_PIO4_25_COMM_ENET_CRS                                                          0x421C0164U, 0xCU, 0x421C8080U, 0x1U

