zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO4_26_HSP_GPIO2_GPIO26                                                       0x421C0168U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_26_COMM_ENET_QOS_RX_DATA3                                                 0x421C0168U, 0x1U, 0x421C806CU, 0x1U
#define IOMUXC_PIO4_26_HSP_FLEXIO2_FXIO_D26                                                   0x421C0168U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_26_MAIN_XSPI0_ECS                                                         0x421C0168U, 0x3U, 0x421C8410U, 0x2U
#define IOMUXC_PIO4_26_MEDIA_CSI_VSYNC                                                        0x421C0168U, 0x4U, 0x421C845CU, 0x1U
#define IOMUXC_PIO4_26_AUDIO_MQS_MQS_LEFT                                                     0x421C0168U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_26_MEDIA_DCIF_VSYNC                                                       0x421C0168U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_26_COMM_TENBASET_PHY0_ED                                                  0x421C0168U, 0x7U, 0x421C80D4U, 0x2U
#define IOMUXC_PIO4_26_HSP_LPUART5_TXD                                                        0x421C0168U, 0x9U, 0x421C82A4U, 0x2U
#define IOMUXC_PIO4_26_HSP_SINC1_MCLK3                                                        0x421C0168U, 0xAU, 0x421C82E4U, 0x1U
#define IOMUXC_PIO4_26_HSP_XBAR1_INOUT26                                                      0x421C0168U, 0xBU, 0x421C83C0U, 0x2U
#define IOMUXC_PIO4_26_COMM_ENET_COL                                                          0x421C0168U, 0xCU, 0x421C807CU, 0x1U

#define IOMUXC_PIO4_27_HSP_GPIO2_GPIO27                                                       0x421C016CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_27_COMM_ENET_QOS_RXEN                                                     0x421C016CU, 0x1U, 0x421C8070U, 0x1U
#define IOMUXC_PIO4_27_HSP_FLEXIO2_FXIO_D27                                                   0x421C016CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_27_MAIN_TRACE_SWO                                                         0x421C016CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_27_MEDIA_CSI_PIXCLK                                                       0x421C016CU, 0x4U, 0x421C8458U, 0x1U
#define IOMUXC_PIO4_27_AUDIO_MQS_MQS_RIGHT                                                    0x421C016CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_27_MEDIA_DCIF_DE                                                          0x421C016CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_27_COMM_TENBASET_PHY0_RX                                                  0x421C016CU, 0x7U, 0x421C80D8U, 0x2U
#define IOMUXC_PIO4_27_HSP_LPUART5_RXD                                                        0x421C016CU, 0x9U, 0x421C82A0U, 0x2U
#define IOMUXC_PIO4_27_HSP_SINC1_BREAK                                                        0x421C016CU, 0xAU, 0x00000000U, 0x0U
#define IOMUXC_PIO4_27_HSP_XBAR1_INOUT27                                                      0x421C016CU, 0xBU, 0x421C83C4U, 0x2U

#define IOMUXC_PIO5_0_HSP_GPIO3_GPIO0                                                         0x421C0180U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_0_MAIN_XSPI1_SS0_N                                                        0x421C0180U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_0_COMM_ENET_REF_CLK                                                       0x421C0180U, 0x3U, 0x421C8078U, 0x1U
#define IOMUXC_PIO5_0_COMM_ENET_TX_CLK_IO                                                     0x421C0180U, 0x4U, 0x421C80A4U, 0x1U
#define IOMUXC_PIO5_0_MAIN_AHB_SRAMC_SRAMC_CS0                                                0x421C0180U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_0_HSP_eFlexPWM3_PWM_A0                                                    0x421C0180U, 0x6U, 0x421C81A4U, 0x1U
#define IOMUXC_PIO5_0_HSP_LPSPI2_PCS0                                                         0x421C0180U, 0x8U, 0x421C8214U, 0x1U

#define IOMUXC_PIO5_1_HSP_GPIO3_GPIO1                                                         0x421C0184U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_1_MAIN_XSPI1_DATA0                                                        0x421C0184U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_1_COMM_ENET_TXD0                                                          0x421C0184U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_1_MAIN_AHB_SRAMC_SRAMC_DA00                                               0x421C0184U, 0x5U, 0x421C83C8U, 0x1U
#define IOMUXC_PIO5_1_HSP_eFlexPWM3_PWM_B0                                                    0x421C0184U, 0x6U, 0x421C81B4U, 0x1U
#define IOMUXC_PIO5_1_HSP_LPSPI2_SOUT                                                         0x421C0184U, 0x8U, 0x421C822CU, 0x1U

#define IOMUXC_PIO5_2_HSP_GPIO3_GPIO2                                                         0x421C0188U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_2_MAIN_XSPI1_DATA1                                                        0x421C0188U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_2_COMM_ENET_TXD1                                                          0x421C0188U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_2_MAIN_AHB_SRAMC_SRAMC_DA01                                               0x421C0188U, 0x5U, 0x421C83CCU, 0x1U
#define IOMUXC_PIO5_2_HSP_eFlexPWM3_PWM_A1                                                    0x421C0188U, 0x6U, 0x421C81A8U, 0x1U
#define IOMUXC_PIO5_2_HSP_LPSPI2_SIN                                                          0x421C0188U, 0x8U, 0x421C8228U, 0x1U

#define IOMUXC_PIO5_3_HSP_GPIO3_GPIO3                                                         0x421C018CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_3_MAIN_XSPI1_DATA2                                                        0x421C018CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_3_COMM_ENET_TX_EN                                                         0x421C018CU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_3_MAIN_AHB_SRAMC_SRAMC_DA02                                               0x421C018CU, 0x5U, 0x421C83D0U, 0x1U
#define IOMUXC_PIO5_3_HSP_eFlexPWM3_PWM_B1                                                    0x421C018CU, 0x6U, 0x421C81B8U, 0x1U
#define IOMUXC_PIO5_3_HSP_LPSPI2_PCS2                                                         0x421C018CU, 0x8U, 0x421C821CU, 0x1U

#define IOMUXC_PIO5_4_HSP_GPIO3_GPIO4                                                         0x421C0190U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_4_MAIN_XSPI1_DATA3                                                        0x421C0190U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_4_COMM_ENET_RXD0                                                          0x421C0190U, 0x4U, 0x421C808CU, 0x1U
#define IOMUXC_PIO5_4_MAIN_AHB_SRAMC_SRAMC_DA03                                               0x421C0190U, 0x5U, 0x421C83D4U, 0x1U
#define IOMUXC_PIO5_4_HSP_eFlexPWM3_PWM_A2                                                    0x421C0190U, 0x6U, 0x421C81ACU, 0x1U
#define IOMUXC_PIO5_4_HSP_LPSPI2_PCS3                                                         0x421C0190U, 0x8U, 0x421C8220U, 0x1U

#define IOMUXC_PIO5_5_HSP_GPIO3_GPIO5                                                         0x421C0194U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_5_MAIN_XSPI1_SCLK0                                                        0x421C0194U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_5_COMM_ENET_RXD1                                                          0x421C0194U, 0x4U, 0x421C8090U, 0x1U
#define IOMUXC_PIO5_5_MAIN_AHB_SRAMC_SRAMC_DA04                                               0x421C0194U, 0x5U, 0x421C83D8U, 0x1U
#define IOMUXC_PIO5_5_HSP_eFlexPWM3_PWM_B2                                                    0x421C0194U, 0x6U, 0x421C81BCU, 0x1U
#define IOMUXC_PIO5_5_HSP_LPSPI2_SCK                                                          0x421C0194U, 0x8U, 0x421C8224U, 0x1U

#define IOMUXC_PIO5_6_HSP_GPIO3_GPIO6                                                         0x421C0198U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_6_MAIN_XSPI1_DATA4                                                        0x421C0198U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_6_COMM_ENET_CRS                                                           0x421C0198U, 0x4U, 0x421C8080U, 0x2U
#define IOMUXC_PIO5_6_MAIN_AHB_SRAMC_SRAMC_DA05                                               0x421C0198U, 0x5U, 0x421C83DCU, 0x1U
#define IOMUXC_PIO5_6_HSP_eFlexPWM3_PWM_A3                                                    0x421C0198U, 0x6U, 0x421C81B0U, 0x1U
#define IOMUXC_PIO5_6_HSP_LPSPI2_PCS1                                                         0x421C0198U, 0x8U, 0x421C8218U, 0x1U

#define IOMUXC_PIO5_7_HSP_GPIO3_GPIO7                                                         0x421C019CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_7_MAIN_XSPI1_DATA5                                                        0x421C019CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_7_COMM_ENET_RX_ER                                                         0x421C019CU, 0x4U, 0x421C80A0U, 0x2U
#define IOMUXC_PIO5_7_MAIN_AHB_SRAMC_SRAMC_DA06                                               0x421C019CU, 0x5U, 0x421C83E0U, 0x1U
#define IOMUXC_PIO5_7_HSP_eFlexPWM3_PWM_B3                                                    0x421C019CU, 0x6U, 0x421C81C0U, 0x1U
#define IOMUXC_PIO5_7_HSP_LPSPI3_SIN                                                          0x421C019CU, 0x8U, 0x421C8240U, 0x0U

#define IOMUXC_PIO5_8_HSP_GPIO3_GPIO8                                                         0x421C01A0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_8_MAIN_XSPI1_DATA6                                                        0x421C01A0U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_8_COMM_ENET_MDIO                                                          0x421C01A0U, 0x4U, 0x421C8084U, 0x1U
#define IOMUXC_PIO5_8_MAIN_AHB_SRAMC_SRAMC_DA07                                               0x421C01A0U, 0x5U, 0x421C83E4U, 0x1U
#define IOMUXC_PIO5_8_HSP_LPSPI3_SOUT                                                         0x421C01A0U, 0x8U, 0x421C8244U, 0x0U

