zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO5_9_HSP_GPIO3_GPIO9                                                         0x421C01A4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_9_MAIN_XSPI1_DATA7                                                        0x421C01A4U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_9_COMM_ENET_MDC                                                           0x421C01A4U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_9_MAIN_AHB_SRAMC_SRAMC_DA08                                               0x421C01A4U, 0x5U, 0x421C83E8U, 0x1U
#define IOMUXC_PIO5_9_HSP_LPSPI3_SCK                                                          0x421C01A4U, 0x8U, 0x421C823CU, 0x0U

#define IOMUXC_PIO5_10_HSP_GPIO3_GPIO10                                                       0x421C01A8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_10_MAIN_XSPI1_DQS0                                                        0x421C01A8U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_10_COMM_FlexSPI_FLR_XSPI_FLR_CS                                           0x421C01A8U, 0x3U, 0x421C80E4U, 0x0U
#define IOMUXC_PIO5_10_MAIN_AHB_SRAMC_SRAMC_DA09                                              0x421C01A8U, 0x5U, 0x421C83ECU, 0x1U
#define IOMUXC_PIO5_10_HSP_LPSPI3_PCS0                                                        0x421C01A8U, 0x8U, 0x421C8230U, 0x0U

#define IOMUXC_PIO5_11_HSP_GPIO3_GPIO11                                                       0x421C01ACU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_11_MAIN_XSPI1_SCLK0_N                                                     0x421C01ACU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_11_MAIN_XSPI1_SS1_N                                                       0x421C01ACU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_11_COMM_FlexSPI_FLR_XSPI_FLR_CLK                                          0x421C01ACU, 0x3U, 0x421C810CU, 0x0U
#define IOMUXC_PIO5_11_COMM_ENET_TXD2                                                         0x421C01ACU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_11_MAIN_AHB_SRAMC_SRAMC_DA10                                              0x421C01ACU, 0x5U, 0x421C83F0U, 0x1U
#define IOMUXC_PIO5_11_HSP_LPSPI3_PCS1                                                        0x421C01ACU, 0x8U, 0x00000000U, 0x0U

#define IOMUXC_PIO5_12_HSP_GPIO3_GPIO12                                                       0x421C01B0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_12_MAIN_XSPI1_DATA8                                                       0x421C01B0U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_12_COMM_FlexSPI_FLR_XSPI_FLR_DATA0                                        0x421C01B0U, 0x3U, 0x421C80ECU, 0x0U
#define IOMUXC_PIO5_12_COMM_ENET_TXD3                                                         0x421C01B0U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_12_MAIN_AHB_SRAMC_SRAMC_DA11                                              0x421C01B0U, 0x5U, 0x421C83F4U, 0x1U
#define IOMUXC_PIO5_12_HSP_SINC0_MCLK_OUT0                                                    0x421C01B0U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_12_HSP_SINC0_MCLK0                                                        0x421C01B0U, 0x7U, 0x421C82B8U, 0x1U
#define IOMUXC_PIO5_12_HSP_LPSPI3_PCS2                                                        0x421C01B0U, 0x8U, 0x421C8234U, 0x0U
#define IOMUXC_PIO5_12_HSP_FLEXIO0_FXIO_D28                                                   0x421C01B0U, 0x9U, 0x421C8118U, 0x0U

#define IOMUXC_PIO5_13_HSP_GPIO3_GPIO13                                                       0x421C01B4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_13_MAIN_XSPI1_DATA9                                                       0x421C01B4U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_13_COMM_FlexSPI_FLR_XSPI_FLR_DATA1                                        0x421C01B4U, 0x3U, 0x421C80F0U, 0x0U
#define IOMUXC_PIO5_13_MAIN_AHB_SRAMC_SRAMC_DA12                                              0x421C01B4U, 0x5U, 0x421C83F8U, 0x1U
#define IOMUXC_PIO5_13_HSP_SINC0_MCLK_OUT1                                                    0x421C01B4U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_13_HSP_SINC0_MCLK1                                                        0x421C01B4U, 0x7U, 0x421C82BCU, 0x1U
#define IOMUXC_PIO5_13_HSP_LPSPI3_PCS3                                                        0x421C01B4U, 0x8U, 0x421C8238U, 0x0U
#define IOMUXC_PIO5_13_HSP_FLEXIO0_FXIO_D29                                                   0x421C01B4U, 0x9U, 0x421C811CU, 0x0U

#define IOMUXC_PIO5_14_HSP_GPIO3_GPIO14                                                       0x421C01B8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_14_MAIN_XSPI1_DATA10                                                      0x421C01B8U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_14_COMM_FlexSPI_FLR_XSPI_FLR_DATA2                                        0x421C01B8U, 0x3U, 0x421C80F4U, 0x0U
#define IOMUXC_PIO5_14_COMM_ENET_RX_CLK                                                       0x421C01B8U, 0x4U, 0x421C8088U, 0x1U
#define IOMUXC_PIO5_14_MAIN_AHB_SRAMC_SRAMC_DA13                                              0x421C01B8U, 0x5U, 0x421C83FCU, 0x1U
#define IOMUXC_PIO5_14_HSP_SINC0_MCLK_OUT2                                                    0x421C01B8U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_14_HSP_SINC0_MCLK2                                                        0x421C01B8U, 0x7U, 0x421C82C0U, 0x1U
#define IOMUXC_PIO5_14_HSP_LPSPI4_SIN                                                         0x421C01B8U, 0x8U, 0x421C8258U, 0x0U
#define IOMUXC_PIO5_14_HSP_FLEXIO0_FXIO_D30                                                   0x421C01B8U, 0x9U, 0x421C8120U, 0x0U

#define IOMUXC_PIO5_15_HSP_GPIO3_GPIO15                                                       0x421C01BCU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_15_MAIN_XSPI1_DATA11                                                      0x421C01BCU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_15_COMM_uSDHC1_CLK                                                        0x421C01BCU, 0x2U, 0x421C80BCU, 0x0U
#define IOMUXC_PIO5_15_COMM_FlexSPI_FLR_XSPI_FLR_DATA3                                        0x421C01BCU, 0x3U, 0x421C80F8U, 0x0U
#define IOMUXC_PIO5_15_COMM_ENET_RXD2                                                         0x421C01BCU, 0x4U, 0x421C8094U, 0x1U
#define IOMUXC_PIO5_15_MAIN_AHB_SRAMC_SRAMC_DA14                                              0x421C01BCU, 0x5U, 0x421C8400U, 0x1U
#define IOMUXC_PIO5_15_HSP_SINC0_MCLK3                                                        0x421C01BCU, 0x7U, 0x421C82C4U, 0x1U
#define IOMUXC_PIO5_15_HSP_LPSPI4_SOUT                                                        0x421C01BCU, 0x8U, 0x421C825CU, 0x0U
#define IOMUXC_PIO5_15_HSP_FLEXIO0_FXIO_D31                                                   0x421C01BCU, 0x9U, 0x421C8124U, 0x0U

#define IOMUXC_PIO5_16_HSP_GPIO3_GPIO16                                                       0x421C01C0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_16_MAIN_XSPI1_DQS1                                                        0x421C01C0U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_16_COMM_uSDHC1_CMD                                                        0x421C01C0U, 0x2U, 0x421C80C0U, 0x0U
#define IOMUXC_PIO5_16_COMM_FlexSPI_FLR_XSPI_FLR_DQS                                          0x421C01C0U, 0x3U, 0x421C80E8U, 0x0U
#define IOMUXC_PIO5_16_COMM_ENET_RXD3                                                         0x421C01C0U, 0x4U, 0x421C8098U, 0x1U
#define IOMUXC_PIO5_16_MAIN_AHB_SRAMC_SRAMC_DA15                                              0x421C01C0U, 0x5U, 0x421C8404U, 0x1U
#define IOMUXC_PIO5_16_HSP_SINC0_MBIT0                                                        0x421C01C0U, 0x7U, 0x421C82A8U, 0x1U
#define IOMUXC_PIO5_16_HSP_LPSPI4_SCK                                                         0x421C01C0U, 0x8U, 0x421C8254U, 0x0U

