zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO5_17_HSP_GPIO3_GPIO17                                                       0x421C01C4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_17_MAIN_XSPI1_DATA12                                                      0x421C01C4U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_17_COMM_uSDHC1_DAT0                                                       0x421C01C4U, 0x2U, 0x421C80C4U, 0x0U
#define IOMUXC_PIO5_17_COMM_FlexSPI_FLR_XSPI_FLR_DATA4                                        0x421C01C4U, 0x3U, 0x421C80FCU, 0x0U
#define IOMUXC_PIO5_17_COMM_ENET_RX_EN                                                        0x421C01C4U, 0x4U, 0x421C809CU, 0x1U
#define IOMUXC_PIO5_17_MAIN_AHB_SRAMC_SRAMC_WEB                                               0x421C01C4U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_17_HSP_SINC0_MBIT1                                                        0x421C01C4U, 0x7U, 0x421C82ACU, 0x1U
#define IOMUXC_PIO5_17_HSP_LPSPI4_PCS0                                                        0x421C01C4U, 0x8U, 0x421C8248U, 0x0U
#define IOMUXC_PIO5_17_HSP_FLEXIO2_FXIO_D28                                                   0x421C01C4U, 0x9U, 0x421C8128U, 0x0U

#define IOMUXC_PIO5_18_HSP_GPIO3_GPIO18                                                       0x421C01C8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_18_MAIN_XSPI1_DATA13                                                      0x421C01C8U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_18_COMM_uSDHC1_DAT1                                                       0x421C01C8U, 0x2U, 0x421C80C8U, 0x0U
#define IOMUXC_PIO5_18_COMM_FlexSPI_FLR_XSPI_FLR_DATA5                                        0x421C01C8U, 0x3U, 0x421C8100U, 0x0U
#define IOMUXC_PIO5_18_COMM_ENET_TX_ER                                                        0x421C01C8U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_18_MAIN_AHB_SRAMC_SRAMC_OEB                                               0x421C01C8U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_18_HSP_SINC0_MBIT2                                                        0x421C01C8U, 0x7U, 0x421C82B0U, 0x1U
#define IOMUXC_PIO5_18_HSP_LPSPI4_PCS1                                                        0x421C01C8U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_18_HSP_FLEXIO2_FXIO_D29                                                   0x421C01C8U, 0x9U, 0x421C812CU, 0x0U

#define IOMUXC_PIO5_19_HSP_GPIO3_GPIO19                                                       0x421C01CCU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_19_MAIN_XSPI1_DATA14                                                      0x421C01CCU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_19_COMM_uSDHC1_DAT2                                                       0x421C01CCU, 0x2U, 0x421C80CCU, 0x0U
#define IOMUXC_PIO5_19_COMM_FlexSPI_FLR_XSPI_FLR_DATA6                                        0x421C01CCU, 0x3U, 0x421C8104U, 0x0U
#define IOMUXC_PIO5_19_COMM_ENET_COL                                                          0x421C01CCU, 0x4U, 0x421C807CU, 0x2U
#define IOMUXC_PIO5_19_MAIN_AHB_SRAMC_SRAMC_ADVB                                              0x421C01CCU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_19_HSP_SINC0_MBIT3                                                        0x421C01CCU, 0x7U, 0x421C82B4U, 0x1U
#define IOMUXC_PIO5_19_HSP_LPSPI4_PCS2                                                        0x421C01CCU, 0x8U, 0x421C824CU, 0x0U
#define IOMUXC_PIO5_19_HSP_FLEXIO2_FXIO_D30                                                   0x421C01CCU, 0x9U, 0x421C8130U, 0x0U

#define IOMUXC_PIO5_20_HSP_GPIO3_GPIO20                                                       0x421C01D0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_20_MAIN_XSPI1_DATA15                                                      0x421C01D0U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_20_COMM_uSDHC1_DAT3                                                       0x421C01D0U, 0x2U, 0x421C80D0U, 0x0U
#define IOMUXC_PIO5_20_COMM_FlexSPI_FLR_XSPI_FLR_DATA7                                        0x421C01D0U, 0x3U, 0x421C8108U, 0x0U
#define IOMUXC_PIO5_20_MAIN_AHB_SRAMC_SRAMC_WP0                                               0x421C01D0U, 0x5U, 0x421C8408U, 0x2U
#define IOMUXC_PIO5_20_HSP_SINC0_BREAK                                                        0x421C01D0U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_20_HSP_LPSPI4_PCS3                                                        0x421C01D0U, 0x8U, 0x421C8250U, 0x0U
#define IOMUXC_PIO5_20_HSP_FLEXIO2_FXIO_D31                                                   0x421C01D0U, 0x9U, 0x421C8134U, 0x0U

#define IOMUXC_PIO6_0_HSP_GPIO4_GPIO0                                                         0x421C0200U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_0_MAIN_XSPI0_SCLK0                                                        0x421C0200U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_0_HSP_LPSPI3_SCK                                                          0x421C0200U, 0x8U, 0x421C823CU, 0x1U

#define IOMUXC_PIO6_1_HSP_GPIO4_GPIO1                                                         0x421C0204U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_1_MAIN_XSPI0_SS0_N                                                        0x421C0204U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_1_HSP_LPSPI3_PCS0                                                         0x421C0204U, 0x8U, 0x421C8230U, 0x1U

#define IOMUXC_PIO6_2_HSP_GPIO4_GPIO2                                                         0x421C0208U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_2_MAIN_XSPI0_DATA0                                                        0x421C0208U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_2_HSP_LPSPI3_SOUT                                                         0x421C0208U, 0x8U, 0x421C8244U, 0x1U

#define IOMUXC_PIO6_3_HSP_GPIO4_GPIO3                                                         0x421C020CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_3_MAIN_XSPI0_DATA1                                                        0x421C020CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_3_HSP_LPSPI3_SIN                                                          0x421C020CU, 0x8U, 0x421C8240U, 0x1U

#define IOMUXC_PIO6_4_HSP_GPIO4_GPIO4                                                         0x421C0210U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_4_MAIN_XSPI0_DATA2                                                        0x421C0210U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_4_HSP_LPSPI3_PCS2                                                         0x421C0210U, 0x8U, 0x421C8234U, 0x1U

