zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO6_5_HSP_GPIO4_GPIO5                                                         0x421C0214U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_5_MAIN_XSPI0_DATA3                                                        0x421C0214U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_5_HSP_LPSPI3_PCS3                                                         0x421C0214U, 0x8U, 0x421C8238U, 0x1U

#define IOMUXC_PIO6_6_HSP_GPIO4_GPIO6                                                         0x421C0218U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_6_MAIN_XSPI0_DQS0                                                         0x421C0218U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_6_HSP_LPSPI4_PCS3                                                         0x421C0218U, 0x8U, 0x421C8250U, 0x1U

#define IOMUXC_PIO6_7_HSP_GPIO4_GPIO7                                                         0x421C021CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_7_MAIN_XSPI0_DATA4                                                        0x421C021CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_7_COMM_uSDHC0_RESET_B                                                     0x421C021CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_7_HSP_eFlexPWM2_PWM_A0                                                    0x421C021CU, 0x5U, 0x421C8174U, 0x2U
#define IOMUXC_PIO6_7_HSP_LPSPI4_SOUT                                                         0x421C021CU, 0x8U, 0x421C825CU, 0x1U
#define IOMUXC_PIO6_7_HSP_LPUART3_TXD                                                         0x421C021CU, 0x9U, 0x421C828CU, 0x2U

#define IOMUXC_PIO6_8_HSP_GPIO4_GPIO8                                                         0x421C0220U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_8_MAIN_XSPI0_DATA5                                                        0x421C0220U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_8_COMM_uSDHC0_CD_B                                                        0x421C0220U, 0x3U, 0x421C80B4U, 0x1U
#define IOMUXC_PIO6_8_HSP_eFlexPWM2_PWM_B0                                                    0x421C0220U, 0x5U, 0x421C8184U, 0x2U
#define IOMUXC_PIO6_8_HSP_LPSPI4_SIN                                                          0x421C0220U, 0x8U, 0x421C8258U, 0x1U
#define IOMUXC_PIO6_8_HSP_LPUART3_RXD                                                         0x421C0220U, 0x9U, 0x421C8288U, 0x2U

#define IOMUXC_PIO6_9_HSP_GPIO4_GPIO9                                                         0x421C0224U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_9_MAIN_XSPI0_DATA6                                                        0x421C0224U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_9_COMM_uSDHC0_WP                                                          0x421C0224U, 0x3U, 0x421C80B8U, 0x1U
#define IOMUXC_PIO6_9_HSP_eFlexPWM2_PWM_A1                                                    0x421C0224U, 0x5U, 0x421C8178U, 0x2U
#define IOMUXC_PIO6_9_HSP_LPSPI4_PCS2                                                         0x421C0224U, 0x8U, 0x421C824CU, 0x1U
#define IOMUXC_PIO6_9_HSP_LPUART4_TXD                                                         0x421C0224U, 0x9U, 0x421C8298U, 0x3U

#define IOMUXC_PIO6_10_HSP_GPIO4_GPIO10                                                       0x421C0228U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_10_MAIN_XSPI0_DATA7                                                       0x421C0228U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_10_HSP_eFlexPWM2_PWM_B1                                                   0x421C0228U, 0x5U, 0x421C8188U, 0x2U
#define IOMUXC_PIO6_10_HSP_LPSPI4_PCS3                                                        0x421C0228U, 0x8U, 0x421C8250U, 0x2U
#define IOMUXC_PIO6_10_HSP_LPUART4_RXD                                                        0x421C0228U, 0x9U, 0x421C8294U, 0x3U

#define IOMUXC_PIO6_11_HSP_GPIO4_GPIO11                                                       0x421C022CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_11_MAIN_XSPI0_SS1_N                                                       0x421C022CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_11_COMM_uSDHC0_VSELECT                                                    0x421C022CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_11_HSP_eFlexPWM2_PWM_A2                                                   0x421C022CU, 0x5U, 0x421C817CU, 0x1U
#define IOMUXC_PIO6_11_HSP_LPSPI4_PCS0                                                        0x421C022CU, 0x8U, 0x421C8248U, 0x1U
#define IOMUXC_PIO6_11_HSP_LPUART5_TXD                                                        0x421C022CU, 0x9U, 0x421C82A4U, 0x3U

#define IOMUXC_PIO6_12_HSP_GPIO4_GPIO12                                                       0x421C0230U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_12_MAIN_XSPI0_SCLK0_N                                                     0x421C0230U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_12_HSP_eFlexPWM2_PWM_B2                                                   0x421C0230U, 0x5U, 0x421C818CU, 0x1U
#define IOMUXC_PIO6_12_HSP_LPSPI4_SCK                                                         0x421C0230U, 0x8U, 0x421C8254U, 0x1U
#define IOMUXC_PIO6_12_HSP_LPUART5_RXD                                                        0x421C0230U, 0x9U, 0x421C82A0U, 0x3U

#define IOMUXC_PIO7_0_HSP_GPIO4_GPIO13                                                        0x421C0280U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_0_COMM_uSDHC0_DAT4                                                        0x421C0280U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_0_COMM_FlexSPI_FLR_XSPI_FLR_DATA0                                         0x421C0280U, 0x2U, 0x421C80ECU, 0x1U
#define IOMUXC_PIO7_0_COMM_uSDHC1_DAT0                                                        0x421C0280U, 0x3U, 0x421C80C4U, 0x1U
#define IOMUXC_PIO7_0_HSP_FLEXIO0_FXIO_D28                                                    0x421C0280U, 0x4U, 0x421C8118U, 0x1U
#define IOMUXC_PIO7_0_HSP_eFlexPWM3_PWM_A0                                                    0x421C0280U, 0x5U, 0x421C81A4U, 0x2U
#define IOMUXC_PIO7_0_HSP_LPSPI1_SIN                                                          0x421C0280U, 0x8U, 0x421C820CU, 0x2U

#define IOMUXC_PIO7_1_HSP_GPIO4_GPIO14                                                        0x421C0284U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_1_COMM_uSDHC0_DAT5                                                        0x421C0284U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_1_COMM_FlexSPI_FLR_XSPI_FLR_DATA1                                         0x421C0284U, 0x2U, 0x421C80F0U, 0x1U
#define IOMUXC_PIO7_1_COMM_uSDHC1_DAT1                                                        0x421C0284U, 0x3U, 0x421C80C8U, 0x1U
#define IOMUXC_PIO7_1_HSP_FLEXIO0_FXIO_D29                                                    0x421C0284U, 0x4U, 0x421C811CU, 0x1U
#define IOMUXC_PIO7_1_HSP_eFlexPWM3_PWM_B0                                                    0x421C0284U, 0x5U, 0x421C81B4U, 0x2U
#define IOMUXC_PIO7_1_HSP_LPSPI1_PCS2                                                         0x421C0284U, 0x8U, 0x421C8200U, 0x2U
#define IOMUXC_PIO7_1_HSP_LPUART3_TXD                                                         0x421C0284U, 0x9U, 0x421C828CU, 0x3U

#define IOMUXC_PIO7_2_HSP_GPIO4_GPIO15                                                        0x421C0288U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_2_COMM_uSDHC0_DAT6                                                        0x421C0288U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_2_COMM_FlexSPI_FLR_XSPI_FLR_DATA2                                         0x421C0288U, 0x2U, 0x421C80F4U, 0x1U
#define IOMUXC_PIO7_2_COMM_uSDHC1_DAT2                                                        0x421C0288U, 0x3U, 0x421C80CCU, 0x1U
#define IOMUXC_PIO7_2_HSP_FLEXIO0_FXIO_D30                                                    0x421C0288U, 0x4U, 0x421C8120U, 0x1U
#define IOMUXC_PIO7_2_HSP_eFlexPWM3_PWM_A1                                                    0x421C0288U, 0x5U, 0x421C81A8U, 0x2U
#define IOMUXC_PIO7_2_HSP_LPSPI1_PCS1                                                         0x421C0288U, 0x8U, 0x421C81FCU, 0x2U
#define IOMUXC_PIO7_2_HSP_LPUART3_RXD                                                         0x421C0288U, 0x9U, 0x421C8288U, 0x3U

#define IOMUXC_PIO7_3_HSP_GPIO4_GPIO16                                                        0x421C028CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_3_COMM_uSDHC0_DAT7                                                        0x421C028CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_3_COMM_FlexSPI_FLR_XSPI_FLR_DATA3                                         0x421C028CU, 0x2U, 0x421C80F8U, 0x1U
#define IOMUXC_PIO7_3_COMM_uSDHC1_DAT3                                                        0x421C028CU, 0x3U, 0x421C80D0U, 0x1U
#define IOMUXC_PIO7_3_HSP_FLEXIO0_FXIO_D31                                                    0x421C028CU, 0x4U, 0x421C8124U, 0x1U
#define IOMUXC_PIO7_3_HSP_eFlexPWM3_PWM_B1                                                    0x421C028CU, 0x5U, 0x421C81B8U, 0x2U
#define IOMUXC_PIO7_3_HSP_LPSPI1_PCS0                                                         0x421C028CU, 0x8U, 0x421C81F8U, 0x2U
#define IOMUXC_PIO7_3_HSP_LPUART3_CTS_B                                                       0x421C028CU, 0x9U, 0x421C8284U, 0x2U

