zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO7_4_HSP_GPIO4_GPIO17                                                        0x421C0290U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_4_COMM_uSDHC0_DS                                                          0x421C0290U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_4_COMM_FlexSPI_FLR_XSPI_FLR_DQS                                           0x421C0290U, 0x2U, 0x421C80E8U, 0x1U
#define IOMUXC_PIO7_4_COMM_uSDHC1_CMD                                                         0x421C0290U, 0x3U, 0x421C80C0U, 0x1U
#define IOMUXC_PIO7_4_HSP_eFlexPWM3_PWM_A2                                                    0x421C0290U, 0x5U, 0x421C81ACU, 0x2U
#define IOMUXC_PIO7_4_HSP_LPSPI1_SOUT                                                         0x421C0290U, 0x8U, 0x421C8210U, 0x2U
#define IOMUXC_PIO7_4_HSP_LPUART3_RTS_B                                                       0x421C0290U, 0x9U, 0x00000000U, 0x0U

#define IOMUXC_PIO7_5_HSP_GPIO4_GPIO18                                                        0x421C0294U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_5_COMM_FlexSPI_FLR_XSPI_FLR_CLK                                           0x421C0294U, 0x2U, 0x421C810CU, 0x1U
#define IOMUXC_PIO7_5_COMM_uSDHC1_CLK                                                         0x421C0294U, 0x3U, 0x421C80BCU, 0x1U
#define IOMUXC_PIO7_5_HSP_eFlexPWM3_PWM_B2                                                    0x421C0294U, 0x5U, 0x421C81BCU, 0x2U
#define IOMUXC_PIO7_5_HSP_LPSPI1_SCK                                                          0x421C0294U, 0x8U, 0x421C8208U, 0x2U

#define IOMUXC_PIO7_6_HSP_GPIO4_GPIO19                                                        0x421C0298U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_6_COMM_uSDHC0_CMD                                                         0x421C0298U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_6_COMM_FlexSPI_FLR_XSPI_FLR_CS                                            0x421C0298U, 0x2U, 0x421C80E4U, 0x1U
#define IOMUXC_PIO7_6_HSP_eFlexPWM0_PWM_A0                                                    0x421C0298U, 0x5U, 0x421C8138U, 0x1U
#define IOMUXC_PIO7_6_HSP_LPSPI2_SOUT                                                         0x421C0298U, 0x8U, 0x421C822CU, 0x2U

#define IOMUXC_PIO7_7_HSP_GPIO4_GPIO20                                                        0x421C029CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_7_COMM_uSDHC0_CLK                                                         0x421C029CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_7_HSP_eFlexPWM0_PWM_B0                                                    0x421C029CU, 0x5U, 0x421C8144U, 0x1U
#define IOMUXC_PIO7_7_HSP_LPSPI2_SCK                                                          0x421C029CU, 0x8U, 0x421C8224U, 0x2U

#define IOMUXC_PIO7_8_HSP_GPIO4_GPIO21                                                        0x421C02A0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_8_COMM_uSDHC0_DAT0                                                        0x421C02A0U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_8_COMM_FlexSPI_FLR_XSPI_FLR_DATA4                                         0x421C02A0U, 0x2U, 0x421C80FCU, 0x1U
#define IOMUXC_PIO7_8_HSP_FLEXIO2_FXIO_D28                                                    0x421C02A0U, 0x4U, 0x421C8128U, 0x1U
#define IOMUXC_PIO7_8_HSP_eFlexPWM0_PWM_A1                                                    0x421C02A0U, 0x5U, 0x421C813CU, 0x1U
#define IOMUXC_PIO7_8_HSP_LPSPI2_SIN                                                          0x421C02A0U, 0x8U, 0x421C8228U, 0x2U
#define IOMUXC_PIO7_8_HSP_LPUART4_RTS_B                                                       0x421C02A0U, 0x9U, 0x00000000U, 0x0U

#define IOMUXC_PIO7_9_HSP_GPIO4_GPIO22                                                        0x421C02A4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_9_COMM_uSDHC0_DAT1                                                        0x421C02A4U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_9_COMM_FlexSPI_FLR_XSPI_FLR_DATA5                                         0x421C02A4U, 0x2U, 0x421C8100U, 0x1U
#define IOMUXC_PIO7_9_HSP_FLEXIO2_FXIO_D29                                                    0x421C02A4U, 0x4U, 0x421C812CU, 0x1U
#define IOMUXC_PIO7_9_HSP_eFlexPWM0_PWM_B1                                                    0x421C02A4U, 0x5U, 0x421C8148U, 0x1U
#define IOMUXC_PIO7_9_HSP_LPSPI2_PCS0                                                         0x421C02A4U, 0x8U, 0x421C8214U, 0x2U
#define IOMUXC_PIO7_9_HSP_LPUART4_CTS_B                                                       0x421C02A4U, 0x9U, 0x421C8290U, 0x3U

#define IOMUXC_PIO7_10_HSP_GPIO4_GPIO23                                                       0x421C02A8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_10_COMM_uSDHC0_DAT2                                                       0x421C02A8U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_10_COMM_FlexSPI_FLR_XSPI_FLR_DATA6                                        0x421C02A8U, 0x2U, 0x421C8104U, 0x1U
#define IOMUXC_PIO7_10_HSP_FLEXIO2_FXIO_D30                                                   0x421C02A8U, 0x4U, 0x421C8130U, 0x1U
#define IOMUXC_PIO7_10_HSP_eFlexPWM0_PWM_A2                                                   0x421C02A8U, 0x5U, 0x421C8140U, 0x1U
#define IOMUXC_PIO7_10_HSP_LPSPI2_PCS1                                                        0x421C02A8U, 0x8U, 0x421C8218U, 0x2U
#define IOMUXC_PIO7_10_HSP_LPUART4_TXD                                                        0x421C02A8U, 0x9U, 0x421C8298U, 0x4U

#define IOMUXC_PIO7_11_HSP_GPIO4_GPIO24                                                       0x421C02ACU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_11_COMM_uSDHC0_DAT3                                                       0x421C02ACU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_11_COMM_FlexSPI_FLR_XSPI_FLR_DATA7                                        0x421C02ACU, 0x2U, 0x421C8108U, 0x1U
#define IOMUXC_PIO7_11_HSP_FLEXIO2_FXIO_D31                                                   0x421C02ACU, 0x4U, 0x421C8134U, 0x1U
#define IOMUXC_PIO7_11_HSP_eFlexPWM0_PWM_B2                                                   0x421C02ACU, 0x5U, 0x421C814CU, 0x1U
#define IOMUXC_PIO7_11_HSP_LPSPI2_PCS2                                                        0x421C02ACU, 0x8U, 0x421C821CU, 0x2U
#define IOMUXC_PIO7_11_HSP_LPUART4_RXD                                                        0x421C02ACU, 0x9U, 0x421C8294U, 0x4U

#define IOMUXC_PIO1_0_WAKE_GPIO0_GPIO0                                                        0x46220000U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_0_WAKE_CMP3_OUT                                                           0x46220000U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_0_WAKE_LPI2C0_SDA                                                         0x46220000U, 0x2U, 0x46228004U, 0x0U
#define IOMUXC_PIO1_0_WAKE_LPSPI0_SIN                                                         0x46220000U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_0_WAKE_LPUART1_CTS_B                                                      0x46220000U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_0_WAKE_LPTMR0_ALT0                                                        0x46220000U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_0_WAKE_QTPM0_CH0                                                          0x46220000U, 0x8U, 0x00000000U, 0x0U

