zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO1_1_WAKE_GPIO0_GPIO1                                                        0x46220004U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_1_WAKE_CMP2_OUT                                                           0x46220004U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_1_WAKE_LPI2C0_SCL                                                         0x46220004U, 0x2U, 0x46228000U, 0x0U
#define IOMUXC_PIO1_1_WAKE_LPSPI0_PCS0                                                        0x46220004U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_1_WAKE_LPUART1_RTS_B                                                      0x46220004U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_1_WAKE_LPTMR0_ALT1                                                        0x46220004U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_1_WAKE_QTPM0_CH1                                                          0x46220004U, 0x8U, 0x00000000U, 0x0U

#define IOMUXC_PIO1_2_WAKE_GPIO0_GPIO2                                                        0x46220008U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_2_WAKE_CMP1_OUT                                                           0x46220008U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_2_WAKE_LPSPI0_SCK                                                         0x46220008U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_2_WAKE_LPUART1_TXD                                                        0x46220008U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_2_WAKE_LPTMR0_ALT2                                                        0x46220008U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_2_WAKE_QTPM0_CH2                                                          0x46220008U, 0x8U, 0x00000000U, 0x0U

#define IOMUXC_PIO1_3_WAKE_GPIO0_GPIO3                                                        0x4622000CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_CMP0_OUT                                                           0x4622000CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_EWM_OUT_B                                                          0x4622000CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_LPSPI0_SOUT                                                        0x4622000CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_XBAR_INOUT0                                                        0x4622000CU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_LPUART1_RXD                                                        0x4622000CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_LPTMR0_ALT3                                                        0x4622000CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_QTPM0_CH3                                                          0x4622000CU, 0x8U, 0x00000000U, 0x0U

#define IOMUXC_PIO1_4_WAKE_GPIO0_GPIO4                                                        0x46220010U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_4_BOOT_MODE0                                                              0x46220010U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_4_WAKE_LPSPI0_PCS1                                                        0x46220010U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_4_WAKE_XBAR_INOUT1                                                        0x46220010U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_4_WAKE_LPUART0_TXD                                                        0x46220010U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_4_WAKE_FREQME_CLK_OUT                                                     0x46220010U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_4_WAKE_LPTMR1_ALT0                                                        0x46220010U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_4_WAKE_QTPM0_CH4                                                          0x46220010U, 0x8U, 0x00000000U, 0x0U

#define IOMUXC_PIO1_5_WAKE_GPIO0_GPIO5                                                        0x46220014U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_5_BOOT_MODE1                                                              0x46220014U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_5_WAKE_XBAR_INOUT2                                                        0x46220014U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_5_WAKE_LPUART0_RXD                                                        0x46220014U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_5_VBAT_RTC_CLKOUT                                                         0x46220014U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_5_WAKE_LPTMR1_ALT1                                                        0x46220014U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_5_WAKE_QTPM0_CH5                                                          0x46220014U, 0x8U, 0x00000000U, 0x0U

#define IOMUXC_PIO1_6_WAKE_GPIO0_GPIO6                                                        0x46220018U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_6_WAKE_LPI2C0_SDA                                                         0x46220018U, 0x2U, 0x46228004U, 0x1U
#define IOMUXC_PIO1_6_WAKE_XBAR_INOUT3                                                        0x46220018U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_6_WAKE_LPUART0_CTS_B                                                      0x46220018U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_6_WAKE_MICFIL_PDM_DATA01                                                  0x46220018U, 0x6U, 0x46228008U, 0x0U
#define IOMUXC_PIO1_6_WAKE_LPTMR1_ALT2                                                        0x46220018U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_6_WAKE_QTPM0_CH6                                                          0x46220018U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_6_JTAGC_TCK                                                               0x46220018U, 0xFU, 0x00000000U, 0x0U

#define IOMUXC_PIO1_7_WAKE_GPIO0_GPIO7                                                        0x4622001CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_7_WAKE_LPI2C0_SCL                                                         0x4622001CU, 0x2U, 0x46228000U, 0x1U
#define IOMUXC_PIO1_7_WAKE_XBAR_INOUT4                                                        0x4622001CU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_7_WAKE_LPUART0_RTS_B                                                      0x4622001CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_7_WAKE_MICFIL_PDM_CLK                                                     0x4622001CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_7_WAKE_LPTMR1_ALT3                                                        0x4622001CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_7_WAKE_QTPM0_CH7                                                          0x4622001CU, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_7_JTAGC_TMS                                                               0x4622001CU, 0xFU, 0x00000000U, 0x0U

