zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc.h
#define IOMUXC_PIO1_8_WAKE_GPIO0_GPIO8                                                        0x46220020U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_8_WAKE_I3C_SDA                                                            0x46220020U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_8_WAKE_LPI2C1_SDA                                                         0x46220020U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_8_WAKE_LPSPI0_PCS2                                                        0x46220020U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_8_WAKE_XBAR_INOUT5                                                        0x46220020U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_8_WAKE_MICFIL_PDM_DATA01                                                  0x46220020U, 0x6U, 0x46228008U, 0x1U
#define IOMUXC_PIO1_8_JTAGC_TDI                                                               0x46220020U, 0xFU, 0x00000000U, 0x0U

#define IOMUXC_PIO1_9_WAKE_GPIO0_GPIO9                                                        0x46220024U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_9_WAKE_I3C_SCL                                                            0x46220024U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_9_WAKE_LPI2C1_SCL                                                         0x46220024U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_9_WAKE_LPSPI0_PCS3                                                        0x46220024U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_9_WAKE_XBAR_INOUT6                                                        0x46220024U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_9_WAKE_MICFIL_PDM_CLK                                                     0x46220024U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_9_JTAGC_TDO                                                               0x46220024U, 0xFU, 0x00000000U, 0x0U

#define IOMUXC_PIO1_10_WAKE_GPIO0_GPIO10                                                      0x46220028U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_10_WAKE_I3C_PUR                                                           0x46220028U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_10_WAKE_XBAR_INOUT7                                                       0x46220028U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_10_JTAGC_TRSTN                                                            0x46220028U, 0xFU, 0x00000000U, 0x0U

#define IOMUXC_PIO0_0_VBAT_GPIO0_GPIO0                                                        0x46360000U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO0_0_PMIC_MODE0                                                              0x46360000U, 0x1U, 0x00000000U, 0x0U

#define IOMUXC_PIO0_1_VBAT_GPIO0_GPIO1                                                        0x46360004U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO0_1_PMIC_MODE1                                                              0x46360004U, 0x1U, 0x00000000U, 0x0U

#define IOMUXC_PIO0_2_VBAT_GPIO0_GPIO2                                                        0x46360008U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO0_2_RTC_TAMPER0                                                             0x46360008U, 0x1U, 0x00000000U, 0x0U

#define IOMUXC_PIO0_3_VBAT_GPIO0_GPIO3                                                        0x4636000CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO0_3_RTC_TAMPER1                                                             0x4636000CU, 0x1U, 0x00000000U, 0x0U

#define IOMUXC_PIO0_4_VBAT_GPIO0_GPIO4                                                        0x46360010U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO0_4_ON_OFF                                                                  0x46360010U, 0x1U, 0x00000000U, 0x0U

#define IOMUXC_PIO0_5_VBAT_GPIO0_GPIO5                                                        0x46360014U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO0_5_PMIC_ON_REQ                                                             0x46360014U, 0x1U, 0x00000000U, 0x0U
/*@}*/

#define IOMUXC_GPR_SAIMCLK_LOWBITMASK (0x7U)
#define IOMUXC_GPR_SAIMCLK_HIGHBITMASK (0x3U)

typedef enum _iomuxc_mqs_pwm_oversample_rate
{
    kIOMUXC_MqsPwmOverSampleRate32 = 0, /* MQS PWM over sampling rate 32. */
    kIOMUXC_MqsPwmOverSampleRate64 = 1  /* MQS PWM over sampling rate 64. */
} iomuxc_mqs_pwm_oversample_rate_t;

#if defined(__cplusplus)
extern "C" {
#endif /*_cplusplus */

/*! @name Configuration */
/*@{*/

/*!
 * @brief Sets the IOMUXC pin mux mode.
 * @note The first five parameters can be filled with the pin function ID macros.
 *
 * This is an example to set the PTA6 as the lpuart0_tx:
 * @code
 * IOMUXC_SetPinMux(IOMUXC_PTA6_LPUART0_TX, 0);
 * @endcode
 *
 * This is an example to set the PTA0 as GPIOA0:
 * @code
 * IOMUXC_SetPinMux(IOMUXC_PTA0_GPIOA0, 0);
 * @endcode
 *
 * @param muxRegister  The pin mux register.
 * @param muxMode      The pin mux mode.
 * @param inputRegister The select input register.
 * @param inputDaisy   The input daisy.
 * @param configRegister  The config register.
 * @param inputOnfield   Software input on field.
 */
static inline void IOMUXC_SetPin_Mux_Config(uint32_t muxRegister,
                                    uint32_t muxMode,
                                    uint32_t inputRegister,
                                    uint32_t inputDaisy,
                                    uint32_t configValue)
{
    /*mux and config are now in the same register*/
    if (muxRegister != 0UL)
    {
        *((volatile uint32_t *)muxRegister) = IOMUXC_PIO_MUX_MODE(muxMode) | configValue;
    }

    if (inputRegister != 0UL)
    {
        *((volatile uint32_t *)inputRegister) = inputDaisy;
    }
}

#if defined(__cplusplus)
}
#endif /*_cplusplus */

/*! @}*/

#endif /* _FSL_IOMUXC_H_ */
